                                                      /* 该SDK由虚幻引擎工具生成,该工具完全免费! */

                                                      /* 作者:BiliBili:窗边的短脚猫 */

                                                      /* Link:https://space.bilibili.com/3671718 */

#pragma once

// DreadHunger-Win64-Shipping SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DreadHunger-Win64-Shipping_DreadHungerUI_structs.hpp"

//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class DreadHungerUI.DH_VisibilityWidget
// size:0x0080 (0x0260 - 0x02E0)
class UDH_VisibilityWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0260(0x0010) MISSED OFFSET
	ESlateVisibility                                   VisibleVisibility;                                        // 0x0270(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	ESlateVisibility                                   HiddenVisibility;                                         // 0x0271(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0272(0x0002) MISSED OFFSET
	struct FGameplayTag                                ShowTag;                                                  // 0x0274(0x0008) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x4];                                       // 0x027C(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       ForceHideTags;                                            // 0x0280(0x0020) (Edit, DisableEditOnInstance)
	float                                              ShowAnimationForwardPlaybackSpeed;                        // 0x02A0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ShowAnimationReversePlaybackSpeed;                        // 0x02A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UWidgetAnimation*                            ShowAnimation;                                            // 0x02A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UWidgetAnimation*                            HideAnimation;                                            // 0x02B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x28];                                      // 0x02B8(0x0028) MISSED OFFSET

	void Show()//offset:0x1047AC0;
	void OnVisibilityWidgetHiddenSignature__DelegateSignature()//offset:0x13CEB30;
	void OnVisibilityTagsChanged(class UDH_UIVisibilityTagHandler* TagHandler)//offset:0x10822B0;
	void OnShown()//offset:0x106C960;
	void OnShow()//offset:0x788E90;
	void OnHide()//offset:0x788E70;
	void OnHidden()//offset:0x1081EF0;
	bool IsHiding()//offset:0x1081DB0;
	void InstantShow()//offset:0x1081D90;
	void InstantHide()//offset:0x1081D70;
	void Hide()//offset:0x1081D50;
	void BP_OnShown()//offset:0x13CEB30;
	void BP_OnHidden()//offset:0x13CEB30;
};


// Class DreadHungerUI.DH_RadialMenuBaseWidget
// size:0x0098 (0x02E0 - 0x0378)
class UDH_RadialMenuBaseWidget : public UDH_VisibilityWidget
{
public:
	bool                                               bDesignTimeDrawDebug;                                     // 0x02E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02E1(0x0003) MISSED OFFSET
	int                                                BaseNumberOfWidgets;                                      // 0x02E4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BaseRotationalOffset;                                     // 0x02E8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CenterButtonMaxRadius;                                    // 0x02EC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CenterButtonDeselectedRadius;                             // 0x02F0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       SelectedColorName;                                        // 0x02F4(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       DeselectedColorName;                                      // 0x02FC(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WidgetRadius;                                             // 0x0304(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          MouseCursorBorderMaterial;                                // 0x0308(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CommitMessageSound;                                       // 0x0310(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  SelectedMessageSound;                                     // 0x0318(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_RadialMenuOptionBaseWidget*              ItemClass;                                                // 0x0320(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCanvasPanel*                                OptionsCanvas;                                            // 0x0328(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0330(0x0008) MISSED OFFSET
	TArray<class UDH_RadialMenuOptionBaseWidget*>      Items;                                                    // 0x0338(0x0010) (ExportObject, ZeroConstructor, Transient)
	class UImage*                                      MouseCursorBorderImage;                                   // 0x0348(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      BorderCursorArrow;                                        // 0x0350(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      CenterCursorImage;                                        // 0x0358(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0360(0x0018) MISSED OFFSET

	static float VecToAngle(const struct FVector2D& InVec)//offset:0x106CA50;
	void UpdateSelectedIndex()//offset:0x106CA30;
	void UpdateMouseCursor(const struct FVector2D& InCursorPosition)//offset:0x106C9A0;
	void SetCursorPosition(const struct FVector2D& InCursorCenter)//offset:0x106C520;
	void SetCanShow(bool bInCanShow)//offset:0x106C490;
	void PopulateOptions()//offset:0x106C3D0;
	void PlaySelectedSound()//offset:0x106C320;
	void OnCommittedOptionFinishedAnimations()//offset:0x106BB80;
	static bool IsSelectedIndex(const struct FFloatRange& SegmentAngles, float MouseAngle)//offset:0x106B9B0;
	class UWidgetAnimation* GetShowAnimation()//offset:0x104BF40;
	int GetSelectedIndexFromMouseAngle(float MouseAngle)//offset:0x106B780;
	int GetSelectedIndex()//offset:0xF53C10;
	static TArray<struct FFloatRange> GetSegmentAngles(int NumberOfSegments, float Radius, float RotationalOffset)//offset:0x106B620;
	class UCanvasPanel* GetOptionsCanvas()//offset:0x106B5E0;
	TArray<struct FDH_RadialOptionPosition> GetOptionPositions(float Radius, int NumberOfOptions)//offset:0x106B4D0;
	int GetNumberOfVisibleWidgets()//offset:0x106B4A0;
	bool GetMouseSelectMode()//offset:0x106B480;
	float GetMouseAngle()//offset:0x106B450;
	struct FVector2D GetCursorPosition()//offset:0x106B420;
	static float GetCenterAngle(float LowerAngle, float UpperAngle)//offset:0x106B350;
	bool GetCanShow()//offset:0x106B330;
	void DoSelectedAction()//offset:0x106B2F0;
	void CreateButtons()//offset:0x106B2D0;
	void BP_OnOptionSetVisible(int OptionIndex)//offset:0x106B240;
	void BP_OnOptionSetHidden(int OptionIndex)//offset:0x106B1B0;
	int BP_OnGetNumberOfOptions()//offset:0x106B120;
	void BP_OnDoSelectedAction()//offset:0x13CEB30;
	bool BP_OnCanUseRadial()//offset:0x106B030;
};


// Class DreadHungerUI.DH_ActionMappingRadialMenuWidget
// size:0x0028 (0x0378 - 0x03A0)
class UDH_ActionMappingRadialMenuWidget : public UDH_RadialMenuBaseWidget
{
public:
	struct FName                                       ActionMappingName;                                        // 0x0378(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0380(0x0020) MISSED OFFSET
};


// Class DreadHungerUI.DH_AttributeViewWidget
// size:0x0090 (0x0260 - 0x02F0)
class UDH_AttributeViewWidget : public UUserWidget
{
public:
	struct UEMulticastInlineDelegate                   OnAttributeViewWidgetCriticalChangedDelegate;             // 0x0260(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              MaxRateOfChange;                                          // 0x0270(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BorderPadding;                                            // 0x0274(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bReversedReserved;                                        // 0x0278(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPlaysPopAnimation;                                       // 0x0279(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bShowRateOfChange;                                        // 0x027A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x027B(0x0005) MISSED OFFSET
	class UMaterialInterface*                          FillMaterial;                                             // 0x0280(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bReversedPulseThreshold;                                  // 0x0288(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0289(0x0003) MISSED OFFSET
	float                                              PulseThreshold;                                           // 0x028C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UDH_RateOfChangeWidget*                      RateOfChangeClass;                                        // 0x0290(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          IconMIDParent;                                            // 0x0298(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_RateOfChangeWidget*                      RateOfChangeWidget;                                       // 0x02A0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UMaterialInstanceDynamic*                    IconMID;                                                  // 0x02A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x02B0(0x0008) MISSED OFFSET
	class UOverlay*                                    BaseOverlay;                                              // 0x02B8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      Icon;                                                     // 0x02C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      PopIcon;                                                  // 0x02C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UOverlay*                                    IconOverlay;                                              // 0x02D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_CircularFillWidget*                      CircularFill;                                             // 0x02D8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            PopAnimation;                                             // 0x02E0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x02E8(0x0008) MISSED OFFSET

	void SetValue(float InValue)//offset:0x1044310;
	void SetTexture(class UTexture2D* InIconTexture)//offset:0x1044280;
	void SetRateOfChange(float InRate)//offset:0x1043F70;
	void SetMaxRateOfChange(float InMaxRate)//offset:0x1043EF0;
	void PlayPopAnimation()//offset:0x1043630;
	void OnCircularFillFillPercentChanged()//offset:0x1043580;
	void OnAttributeViewWidgetCriticalChangedSignature__DelegateSignature(class UDH_AttributeViewWidget* ViewWidget)//offset:0x13CEB30;
	void Init(class UTexture2D* InIconTexture, const struct FLinearColor& IconColor)//offset:0x1043340;
	float GetMaxRateOfChange()//offset:0x1043320;
	bool GetCritical()//offset:0x10432B0;
	class UDH_CircularFillWidget* GetCircularFill()//offset:0x1043290;
};


// Class DreadHungerUI.DH_AutoSearchForLobbiesButtonWidget
// size:0x0000 (0x0260 - 0x0260)
class UDH_AutoSearchForLobbiesButtonWidget : public UUserWidget
{
public:

	void AutoSearch()//offset:0x10431D0;
};


// Class DreadHungerUI.DH_LootContainerBaseWidget
// size:0x0020 (0x02E0 - 0x0300)
class UDH_LootContainerBaseWidget : public UDH_VisibilityWidget
{
public:

	void SetOwningCraftingComponent(class UDH_CraftingComponent* InOwningCraftingComponent)//offset:0x105BB40;
	void SetHeatSourceComponent(class UDH_HeatSourceComponent* InHeatSourceComponent)//offset:0x1063D70;
	void OnTransactingInventoryChanged(class UDH_InventoryTransactionComponent* InInventoryTransactionComponent, class UDH_InventoryManager* InInventoryManager)//offset:0x1063AE0;
	class UDH_CraftingComponent* GetOwningCraftingComponent()//offset:0x1062DC0;
	class UDH_HeatSourceComponent* GetHeatSourceComponent()//offset:0x1062C70;
};


// Class DreadHungerUI.DH_CraftingStationWidget
// size:0x0028 (0x0300 - 0x0328)
class UDH_CraftingStationWidget : public UDH_LootContainerBaseWidget
{
public:
	class UUserWidget*                                 CraftingRecipeClass;                                      // 0x0300(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                InitialNumOfRecipeButtons;                                // 0x0308(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x030C(0x0004) MISSED OFFSET
	class UDH_CraftingStationViewWidget*               View;                                                     // 0x0310(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0318(0x0010) MISSED OFFSET

	void OnViewHidden()//offset:0x104CF00;
	void OnCraftingStationViewClose()//offset:0x104C4C0;
	void OnCraftingComponentActivated(class UActorComponent* Component, bool bReset)//offset:0x104C2D0;
	void OnCraftableRecipesChanged()//offset:0x104C2B0;
};


// Class DreadHungerUI.DH_BoilerInventoryWidget
// size:0x0008 (0x0328 - 0x0330)
class UDH_BoilerInventoryWidget : public UDH_CraftingStationWidget
{
public:
	class UDH_FuelGaugeWidget*                         FuelGauge;                                                // 0x0328(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};


// Class DreadHungerUI.DH_BrowseExpeditionsButtonWidget
// size:0x0028 (0x0260 - 0x0288)
class UDH_BrowseExpeditionsButtonWidget : public UUserWidget
{
public:
	struct UEMulticastInlineDelegate                   OnClickedDelegate;                                        // 0x0260(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UDH_ButtonWidget*                            BaseButton;                                               // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_LobbiesRestrictionWidget*                LobbiesRestriction;                                       // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0280(0x0008) MISSED OFFSET

	void OnLobbiesRestrictionWidgetRestrictedChanged(bool bRestricted)//offset:0x10435A0;
	void OnBrowseExpeditionsButtonWidgetClicked__DelegateSignature()//offset:0x13CEB30;
	void OnBaseButtonClicked(class UDH_ButtonWidget* InButton)//offset:0x1043440;
};


// Class DreadHungerUI.DH_ButtonWidget
// size:0x0190 (0x0260 - 0x03F0)
class UDH_ButtonWidget : public UUserWidget
{
public:
	struct UEMulticastInlineDelegate                   OnButtonControllerHoveredDelegate;                        // 0x0260(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               bDesignTimeHovered;                                       // 0x0270(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDesignTimeDisabled;                                      // 0x0271(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0272(0x0002) MISSED OFFSET
	struct FMargin                                     ButtonSlotPadding;                                        // 0x0274(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinWidth;                                                 // 0x0284(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FSlateBrush                                 HoverBrush;                                               // 0x0288(0x0088) (Edit)
	TEnumAsByte<EVerticalAlignment>                    HoverBrushVerticalAlignment;                              // 0x0310(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0311(0x0007) MISSED OFFSET
	struct FSlateBrush                                 DisabledBrush;                                            // 0x0318(0x0088) (Edit)
	TEnumAsByte<EVerticalAlignment>                    DisabledBrushVerticalAlignment;                           // 0x03A0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EHorizontalAlignment>                  DisabledBrushHorizontalAlignment;                         // 0x03A1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x03A2(0x0006) MISSED OFFSET
	class USoundBase*                                  OnHoverSound;                                             // 0x03A8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  OnClickedSound;                                           // 0x03B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HoverOpacityLerpSpeed;                                    // 0x03B8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x03BC(0x0004) MISSED OFFSET
	class UButton*                                     BaseButton;                                               // 0x03C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UNamedSlot*                                  ButtonSlot;                                               // 0x03C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      DisabledImage;                                            // 0x03D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x03D8(0x0008) MISSED OFFSET
	struct UEMulticastInlineDelegate                   OnClickedDelegate;                                        // 0x03E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	void SetHoverBrush(const struct FSlateBrush& InHoverBrush)//offset:0x1043950;
	void OnButtonControllerHoveredSignature__DelegateSignature()//offset:0x13CEB30;
	void Clicked()//offset:0x788E70;
	void BP_OnSetMinWidth(float InMinWidth)//offset:0x13CEB30;
	void BP_OnSetHoverOpacity(float InOpacity)//offset:0x13CEB30;
	void BP_OnSetHoverBrushVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment)//offset:0x13CEB30;
	void BP_OnSetHoverBrush(const struct FSlateBrush& InHoverBrush)//offset:0x13CEB30;
};


// Class DreadHungerUI.DH_BuyButtonTooltipItemWidget
// size:0x0020 (0x0260 - 0x0280)
class UDH_BuyButtonTooltipItemWidget : public UUserWidget
{
public:
	class UDH_CosmeticItemBase*                        DesignTimeItem;                                           // 0x0260(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UDH_CosmeticItemViewWidget*                  View;                                                     // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_TextBlockWidget*                         CantAffordLabel;                                          // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_TextBlockWidget*                         Label;                                                    // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};


// Class DreadHungerUI.DH_BuyButtonTooltipWidget
// size:0x0068 (0x0260 - 0x02C8)
class UDH_BuyButtonTooltipWidget : public UUserWidget
{
public:
	class UWrapBox*                                    NonBundleItems;                                           // 0x0260(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWrapBox*                                    BundleItems;                                              // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<class UDH_CosmeticBundle*>                  DesignTimeBundleItems;                                    // 0x0270(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UDH_CosmeticItemBase*>                DesignTimeNonBundleItems;                                 // 0x0280(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UDH_BuyButtonTooltipItemWidget*>      ItemWidgets;                                              // 0x0290(0x0010) (ExportObject, ZeroConstructor, Transient)
	TArray<class UDH_CosmeticBundleTooltipWidget*>     BundleWidgets;                                            // 0x02A0(0x0010) (ExportObject, ZeroConstructor, Transient)
	class UDH_BuyButtonTooltipItemWidget*              ItemWidgetClass;                                          // 0x02B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_CosmeticBundleTooltipWidget*             BundleWidgetClass;                                        // 0x02B8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                PreConstructedBundleCount;                                // 0x02C0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                PreConstructedItemCount;                                  // 0x02C4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};


// Class DreadHungerUI.DH_OverlayWidget
// size:0x0018 (0x02E0 - 0x02F8)
class UDH_OverlayWidget : public UDH_VisibilityWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02E0(0x0008) MISSED OFFSET
	bool                                               bUseViewForVisibilityAnimations;                          // 0x02E8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x02E9(0x0007) MISSED OFFSET
	class UDH_OverlayViewWidget*                       View;                                                     // 0x02F0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};


// Class DreadHungerUI.DH_CantFindLobbyOverlayWidget
// size:0x0000 (0x02F8 - 0x02F8)
class UDH_CantFindLobbyOverlayWidget : public UDH_OverlayWidget
{
public:
};


// Class DreadHungerUI.DH_CheckBoxWidget
// size:0x0020 (0x0260 - 0x0280)
class UDH_CheckBoxWidget : public UUserWidget
{
public:
	float                                              Size;                                                     // 0x0260(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0264(0x0004) MISSED OFFSET
	struct UEMulticastInlineDelegate                   OnCheckBoxStateDelegate;                                  // 0x0268(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UCheckBox*                                   BaseCheckBox;                                             // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	void SetChecked(bool bInChecked)//offset:0x1043700;
	void OnCheckBoxWidgetStateChanged__DelegateSignature(bool bChecked)//offset:0x13CEB30;
	void OnCheckBoxComponentStateChanged(bool bInIsChecked)//offset:0x10434F0;
	bool IsChecked()//offset:0x1043410;
	class UCheckBox* GetBaseCheckBox()//offset:0x1043270;
};


// Class DreadHungerUI.DH_CircularFillWidget
// size:0x00E0 (0x0260 - 0x0340)
class UDH_CircularFillWidget : public UUserWidget
{
public:
	struct UEMulticastInlineDelegate                   OnCircularFillFillPercentChangedDelegate;                 // 0x0260(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              DesignTimeFillLoopTime;                                   // 0x0270(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DesignTimeDesiredLoopTime;                                // 0x0274(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DesignTimeReservedLoopTime;                               // 0x0278(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DesignTimeInnerFillLoopTime;                              // 0x027C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Size;                                                     // 0x0280(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              InterpRate;                                               // 0x0284(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bReversedReserve;                                         // 0x0288(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0289(0x0007) MISSED OFFSET
	class UMaterialInterface*                          MIDParentMaterial;                                        // 0x0290(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UImage*                                      BaseImage;                                                // 0x0298(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UMaterialInstanceDynamic*                    Mid;                                                      // 0x02A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x98];                                      // 0x02A8(0x0098) MISSED OFFSET

	void Update(float InDeltaTime)//offset:0x1044390;
	void SetReverseReserved(bool bInReversedReserve)//offset:0x1044160;
	void SetReservedTint(const struct FLinearColor& Tint)//offset:0x10440D0;
	void SetReservedPercent(float ReservedPct, bool bInSkipInterp)//offset:0x1043FF0;
	void SetMIDParentMaterial(class UMaterialInterface* InMIDParentMaterial)//offset:0x1043E60;
	void SetInterpolatedReservedPercent(float InterpolatedReservedPct)//offset:0x1043DE0;
	void SetInterpolatedInnerFillPercent(float InterpolatedInnerFillPct)//offset:0x1043D60;
	void SetInterpolatedFillPercent(float InterpolatedFillPct)//offset:0x1043CE0;
	void SetInterpolatedDesiredPercent(float InterpolatedDesiredPct)//offset:0x1043C60;
	void SetInnerFillPercent(float InnerFillPct, bool bInSkipInterp)//offset:0x1043B80;
	void SetFillPercent(float FillPct, bool bInSkipInterp)//offset:0x1043870;
	void SetDesiredPercent(float DesiredPct, bool bInSkipInterp)//offset:0x1043790;
	void SetBaseTint(const struct FLinearColor& Tint)//offset:0x1043670;
	void OnCircularFillFillPercentChangedSignature__DelegateSignature()//offset:0x13CEB30;
	float GetFillPercent()//offset:0x10432E0;
	void DesignTimeAlternateReservedPct()//offset:0x1043250;
	void DesignTimeAlternateInnerFillPct()//offset:0x1043230;
	void DesignTimeAlternateFillPct()//offset:0x1043210;
	void DesignTimeAlternateDesiredPct()//offset:0x10431F0;
};


// Class DreadHungerUI.DH_CloseButtonWidget
// size:0x0018 (0x0260 - 0x0278)
class UDH_CloseButtonWidget : public UUserWidget
{
public:
	struct UEMulticastInlineDelegate                   OnCloseButtonWidgetClickedDelegate;                       // 0x0260(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UButton*                                     BaseButton;                                               // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	void OnCloseButtonWidgetClickedSignature__DelegateSignature()//offset:0x13CEB30;
	void OnButtonClicked()//offset:0x10434D0;
};


// Class DreadHungerUI.DH_CompendiumItemBase
// size:0x00C0 (0x0030 - 0x00F0)
class UDH_CompendiumItemBase : public UDataAsset
{
public:
	struct FText                                       Title;                                                    // 0x0030(0x0028) (Edit, DisableEditOnInstance)
	class FString                                      UniqueId;                                                 // 0x0048(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FText                                       Description;                                              // 0x0058(0x0028) (Edit, DisableEditOnInstance)
	class UTexture2D*                                  Icon;                                                     // 0x0070(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USkeletalMesh*                               SkeletalMesh;                                             // 0x0078(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UStaticMesh*                                 StaticMesh;                                               // 0x0080(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FCompendiumItemStat>                 StatsArray;                                               // 0x0088(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0098(0x0008) MISSED OFFSET
	struct FTransform                                  RelativeTransform;                                        // 0x00A0(0x0030) (Edit, DisableEditOnInstance, IsPlainOldData)
	class UAnimationAsset*                             Animation;                                                // 0x00D0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  ShownSound;                                               // 0x00D8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMediaSource*                                MediaSource;                                              // 0x00E0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00E8(0x0008) MISSED OFFSET
};


// Class DreadHungerUI.DH_CompendiumCreature
// size:0x0000 (0x00F0 - 0x00F0)
class UDH_CompendiumCreature : public UDH_CompendiumItemBase
{
public:
};


// Class DreadHungerUI.DH_CompendiumInventory
// size:0x0000 (0x00F0 - 0x00F0)
class UDH_CompendiumInventory : public UDH_CompendiumItemBase
{
public:
};


// Class DreadHungerUI.DH_CompendiumItemAvatar
// size:0x0040 (0x0220 - 0x0260)
class ADH_CompendiumItemAvatar : public AActor
{
public:
	int                                                RenderTargetWidth;                                        // 0x0220(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                RenderTargetHeight;                                       // 0x0224(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USceneComponent*                             SceneRoot;                                                // 0x0228(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USkeletalMeshComponent*                      AvatarSkeletalMesh;                                       // 0x0230(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UStaticMeshComponent*                        AvatarStaticMesh;                                         // 0x0238(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UTextureRenderTarget2D*                      AvatarRT;                                                 // 0x0240(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDirectionalLightComponent*                  AvatarDirectionalLight;                                   // 0x0248(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UDH_AvatarSceneCaptureComponent*             AvatarSceneCapture;                                       // 0x0250(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0258(0x0008) MISSED OFFSET

	void SetShouldRender(bool bShouldRender)//offset:0x10441F0;
	void ResetMeshOrientation()//offset:0x1043650;
};


// Class DreadHungerUI.DH_CompendiumItemAvatarWidget
// size:0x0050 (0x0260 - 0x02B0)
class UDH_CompendiumItemAvatarWidget : public UUserWidget
{
public:
	class UMaterialInterface*                          AvatarImageMaterial;                                      // 0x0260(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_CompendiumItemAvatar*                    AvatarClass;                                              // 0x0268(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  ButtonClickSound;                                         // 0x0270(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UImage*                                      AvatarPortrait;                                           // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UMaterialInstanceDynamic*                    AvatarMID;                                                // 0x0280(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMediaPlayer*                                MediaPlayer;                                              // 0x0288(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMediaTexture*                               MediaTexture;                                             // 0x0290(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0298(0x0018) MISSED OFFSET
};


// Class DreadHungerUI.DH_CompendiumItemButtonViewWidget
// size:0x0030 (0x0260 - 0x0290)
class UDH_CompendiumItemButtonViewWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0260(0x0010) MISSED OFFSET
	struct FVector2D                                   UnavailableOverlaySize;                                   // 0x0270(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UImage*                                      UnavailableImage;                                         // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_TextBlockWidget*                         Label;                                                    // 0x0280(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UButton*                                     BaseButton;                                               // 0x0288(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	void OnBaseButtonClicked()//offset:0x10434D0;
	void CompendiumItemButtonViewWidgetSignature__DelegateSignature()//offset:0x13CEB30;
};


// Class DreadHungerUI.DH_CompendiumItemButtonWidget
// size:0x0030 (0x0260 - 0x0290)
class UDH_CompendiumItemButtonWidget : public UUserWidget
{
public:
	class USoundBase*                                  ViewClickedSound;                                         // 0x0260(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  MouseEnterSound;                                          // 0x0268(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UImage*                                      SelectedImage;                                            // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_CompendiumItemButtonViewWidget*          View;                                                     // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0280(0x0010) MISSED OFFSET

	void OnViewClicked()//offset:0x788E70;
};


// Class DreadHungerUI.DH_CompendiumItemStatWidget
// size:0x0010 (0x0260 - 0x0270)
class UDH_CompendiumItemStatWidget : public UUserWidget
{
public:
	class UImage*                                      Icon;                                                     // 0x0260(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_TextBlockWidget*                         Value;                                                    // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};


// Class DreadHungerUI.DH_CompendiumSpell
// size:0x0000 (0x00F0 - 0x00F0)
class UDH_CompendiumSpell : public UDH_CompendiumItemBase
{
public:
};


// Class DreadHungerUI.DH_CompendiumStat
// size:0x0028 (0x0030 - 0x0058)
class UDH_CompendiumStat : public UDataAsset
{
public:
	struct FText                                       ToolTip;                                                  // 0x0030(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UTexture2D*                                  Icon;                                                     // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	ECompendiumValueDisplayFormat                      ValueFormat;                                              // 0x0050(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
};


// Class DreadHungerUI.DH_CompendiumTopic
// size:0x0040 (0x0030 - 0x0070)
class UDH_CompendiumTopic : public UDataAsset
{
public:
	struct FText                                       Title;                                                    // 0x0030(0x0028) (Edit, DisableEditOnInstance)
	class FString                                      UniqueId;                                                 // 0x0048(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UTexture2D*                                  Icon;                                                     // 0x0058(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UDH_CompendiumItemBase*>              Items;                                                    // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};


// Class DreadHungerUI.DH_CompendiumTopicButtonViewWidget
// size:0x0030 (0x0260 - 0x0290)
class UDH_CompendiumTopicButtonViewWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0260(0x0010) MISSED OFFSET
	struct FVector2D                                   UnavailableOverlaySize;                                   // 0x0270(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UImage*                                      UnavailableImage;                                         // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UButton*                                     BaseButton;                                               // 0x0280(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      Icon;                                                     // 0x0288(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	void OnBaseButtonClicked()//offset:0x10434D0;
	void CompendiumTopicButtonViewWidgetSignature__DelegateSignature()//offset:0x13CEB30;
};


// Class DreadHungerUI.DH_CompendiumTopicButtonWidget
// size:0x0030 (0x0260 - 0x0290)
class UDH_CompendiumTopicButtonWidget : public UUserWidget
{
public:
	class USoundBase*                                  ViewClickedSound;                                         // 0x0260(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  MouseEnterSound;                                          // 0x0268(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UImage*                                      SelectedImage;                                            // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_CompendiumTopicButtonViewWidget*         View;                                                     // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0280(0x0010) MISSED OFFSET

	void OnViewClicked()//offset:0x788E70;
};


// Class DreadHungerUI.DH_JournalPageWidget
// size:0x0028 (0x02E0 - 0x0308)
class UDH_JournalPageWidget : public UDH_VisibilityWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02E0(0x0008) MISSED OFFSET
	class USoundBase*                                  OpenSound;                                                // 0x02E8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CloseSound;                                               // 0x02F0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UButton*                                     CloseButton;                                              // 0x02F8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0300(0x0008) MISSED OFFSET
};


// Class DreadHungerUI.DH_CompendiumWidget
// size:0x00B0 (0x0308 - 0x03B8)
class UDH_CompendiumWidget : public UDH_JournalPageWidget
{
public:
	class UDH_CompendiumTopicButtonWidget*             TopicButtonWidgetClass;                                   // 0x0308(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_CompendiumItemButtonWidget*              ItemButtonWidgetClass;                                    // 0x0310(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_CompendiumItemStatWidget*                ItemStatWidgetClass;                                      // 0x0318(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0320(0x0030) MISSED OFFSET
	TArray<class UDH_CompendiumTopic*>                 Topics;                                                   // 0x0350(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UDH_TextBlockWidget*                         TopicLabel;                                               // 0x0360(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_TextBlockWidget*                         ItemLabel;                                                // 0x0368(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      ItemIcon;                                                 // 0x0370(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class URichTextBlock*                              ItemDescription;                                          // 0x0378(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UVerticalBox*                                StatsList;                                                // 0x0380(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWrapBox*                                    TopicList;                                                // 0x0388(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UScrollBox*                                  ItemList;                                                 // 0x0390(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_CompendiumItemAvatarWidget*              ItemAvatarWidget;                                         // 0x0398(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAudioComponent*                             ItemShownSound;                                           // 0x03A0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UDH_CompendiumItemBase*                      CurrentItem;                                              // 0x03A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UDH_CompendiumTopic*                         CurrentTopic;                                             // 0x03B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	void OnRichTextHyperlinkClicked(const class FString& ItemId)//offset:0x1048360;
};


// Class DreadHungerUI.DH_ConfirmItemPurchaseOverlayWidget
// size:0x0010 (0x02F8 - 0x0308)
class UDH_ConfirmItemPurchaseOverlayWidget : public UDH_OverlayWidget
{
public:
	class UDH_TextBlockWidget*                         SubTextLabel;                                             // 0x02F8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidget*                                     Throbber;                                                 // 0x0300(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	void OnItemPurchased(TArray<class FString> ItemCodes)//offset:0x1048290;
};


// Class DreadHungerUI.DH_ConnectToIPWidget
// size:0x0000 (0x0260 - 0x0260)
class UDH_ConnectToIPWidget : public UUserWidget
{
public:

	void StartGame(TArray<unsigned char> IPAddress, int Port)//offset:0x1048780;
	bool GetIPAddress(const class FString& Name, TArray<unsigned char>* Out_IPAddress, int* Out_Port)//offset:0x1047BA0;
	void BP_ShowConnectToIPAddressWidget()//offset:0x13CEB30;
};


// Class DreadHungerUI.DH_ContextMenuWidget
// size:0x0010 (0x02E0 - 0x02F0)
class UDH_ContextMenuWidget : public UDH_VisibilityWidget
{
public:
};


// Class DreadHungerUI.DH_CosmeticBundleTooltipWidget
// size:0x0038 (0x0260 - 0x0298)
class UDH_CosmeticBundleTooltipWidget : public UUserWidget
{
public:
	class UDH_CosmeticBundle*                          DesignTimeBundle;                                         // 0x0260(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWrapBox*                                    ItemContainer;                                            // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_TextBlockWidget*                         Label;                                                    // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_BuyButtonTooltipItemWidget*              ItemWidgetClass;                                          // 0x0278(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UDH_BuyButtonTooltipItemWidget*>      ItemWidgets;                                              // 0x0280(0x0010) (ExportObject, ZeroConstructor, Transient)
	int                                                MaxItems;                                                 // 0x0290(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                PreConstructedItemCount;                                  // 0x0294(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};


// Class DreadHungerUI.DH_CosmeticDropZoneWidget
// size:0x0010 (0x0260 - 0x0270)
class UDH_CosmeticDropZoneWidget : public UUserWidget
{
public:
	class UWidget*                                     DropZone;                                                 // 0x0260(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0268(0x0008) MISSED OFFSET
};


// Class DreadHungerUI.DH_CosmeticFilterButton
// size:0x0058 (0x0260 - 0x02B8)
class UDH_CosmeticFilterButton : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0260(0x0010) MISSED OFFSET
	class UObject*                                     NoIconTexture;                                            // 0x0270(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_CosmeticFilterButtonTooltipWidget*       FilterTooltipClass;                                       // 0x0278(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EFilterButtonSelectionType                         SelectionType;                                            // 0x0280(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0281(0x0007) MISSED OFFSET
	class UDH_ButtonWidget*                            FilterButton;                                             // 0x0288(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      IconBackground;                                           // 0x0290(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      IconImage;                                                // 0x0298(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      SelectedImage;                                            // 0x02A0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_CosmeticFilterButtonTooltipWidget*       FilterTooltip;                                            // 0x02A8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x02B0(0x0008) MISSED OFFSET

	void OnFilterButtonClicked(class UDH_ButtonWidget* InButton)//offset:0x1048200;
};


// Class DreadHungerUI.DH_CosmeticFilterButtonTooltipWidget
// size:0x0010 (0x0260 - 0x0270)
class UDH_CosmeticFilterButtonTooltipWidget : public UUserWidget
{
public:
	unsigned char                                      DesignTimeFilterType;                                     // 0x0260(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0261(0x0007) MISSED OFFSET
	class UDH_TextBlockWidget*                         Label;                                                    // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};


// Class DreadHungerUI.DH_CosmeticItemData
// size:0x0018 (0x0028 - 0x0040)
class UDH_CosmeticItemData : public UObject
{
public:
	class UDH_CosmeticItemBase*                        AssociatedItem;                                           // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET
};


// Class DreadHungerUI.DH_CosmeticItemDraggedWidget
// size:0x0018 (0x0260 - 0x0278)
class UDH_CosmeticItemDraggedWidget : public UUserWidget
{
public:
	class UDH_CosmeticItemBase*                        DesignTimeCosmeticItem;                                   // 0x0260(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UDH_CosmeticItemViewWidget*                  View;                                                     // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET
};


// Class DreadHungerUI.DH_CosmeticItemListWidget
// size:0x0140 (0x0260 - 0x03A0)
class UDH_CosmeticItemListWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0260(0x0050) UNKNOWN PROPERTY: 
	TMap<unsigned char, class UObject*>                FilterImages;                                             // 0x02B0(0x0050) (Edit, DisableEditOnInstance)
	class USoundBase*                                  HoverSound;                                               // 0x0300(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_CosmeticFilterButton*                    FilterButtonClass;                                        // 0x0308(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_CosmeticsFilterSectionWidget*            FilterSectionClass;                                       // 0x0310(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_DebugButtonWidget*                       DebugButtonClass;                                         // 0x0318(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShowSectionHeaders;                                      // 0x0320(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSingleSection;                                           // 0x0321(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0322(0x0006) MISSED OFFSET
	TArray<class UDH_CosmeticItemData*>                AvailableListObjects;                                     // 0x0328(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData02[0x50];                                      // 0x0338(0x0050) MISSED OFFSET
	class UVerticalBox*                                SectionsList;                                             // 0x0388(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UScrollBox*                                  SectionScrollBox;                                         // 0x0390(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UHorizontalBox*                              FilterList;                                               // 0x0398(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	void ToggleFilter(unsigned char InFilter)//offset:0x10488D0;
	void Show()//offset:0x788E90;
	void Hide()//offset:0x788E70;
	void GenerateAvailableListObjects()//offset:0x1047AC0;
};


// Class DreadHungerUI.DH_CosmeticItemTooltipWidget
// size:0x0038 (0x0260 - 0x0298)
class UDH_CosmeticItemTooltipWidget : public UUserWidget
{
public:
