                                                      /* 该SDK由虚幻引擎工具生成,该工具完全免费! */

                                                      /* 作者:BiliBili:窗边的短脚猫 */

                                                      /* Link:https://space.bilibili.com/3671718 */

#pragma once

// DreadHunger-Win64-Shipping SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DreadHunger-Win64-Shipping_UMG_structs.hpp"

//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class UMG.Visual
// size:0x0000 (0x0028 - 0x0028)
class UVisual : public UObject
{
public:
};


// Class UMG.Widget
// size:0x00E0 (0x0028 - 0x0108)
class UWidget : public UVisual
{
public:
	class UPanelSlot*                                  Slot;                                                     // 0x0028(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptDelegate                             bIsEnabledDelegate;                                       // 0x0030(0x0014) (ZeroConstructor, InstancedReference)
	struct FText                                       ToolTipText;                                              // 0x0040(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             ToolTipTextDelegate;                                      // 0x0058(0x0014) (ZeroConstructor, InstancedReference)
	class UWidget*                                     ToolTipWidget;                                            // 0x0068(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FScriptDelegate                             ToolTipWidgetDelegate;                                    // 0x0070(0x0014) (ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             VisibilityDelegate;                                       // 0x0080(0x0014) (ZeroConstructor, InstancedReference)
	struct FWidgetTransform                            RenderTransform;                                          // 0x0090(0x001C) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FVector2D                                   RenderTransformPivot;                                     // 0x00AC(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsVariable;                                              // 0x00B4(0x0001)
	unsigned char                                      bCreatedByConstructionScript;                             // 0x00B4(0x0001) (Transient)
	unsigned char                                      bIsEnabled;                                               // 0x00B4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOverride_Cursor;                                         // 0x00B4(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00B5(0x0003) MISSED OFFSET
	class USlateAccessibleWidgetData*                  AccessibleWidgetData;                                     // 0x00B8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      bIsVolatile;                                              // 0x00C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<EMouseCursor>                          Cursor;                                                   // 0x00C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EWidgetClipping                                    Clipping;                                                 // 0x00C2(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	ESlateVisibility                                   Visibility;                                               // 0x00C3(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RenderOpacity;                                            // 0x00C4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UWidgetNavigation*                           Navigation;                                               // 0x00C8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	EFlowDirectionPreference                           FlowDirectionPreference;                                  // 0x00D0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x27];                                      // 0x00D1(0x0027) MISSED OFFSET
	TArray<class UPropertyBinding*>                    NativeBindings;                                           // 0x00F8(0x0010) (ZeroConstructor, Transient)

	void SetVisibility(ESlateVisibility InVisibility)//offset:0x2498100;
	void SetUserFocus(class APlayerController* PlayerController)//offset:0x2497ED0;
	void SetToolTipText(const struct FText& InToolTipText)//offset:0x2497E00;
	void SetToolTip(class UWidget* Widget)//offset:0x2497D70;
	void SetRenderTranslation(const struct FVector2D& Translation)//offset:0x2497C60;
	void SetRenderTransformPivot(const struct FVector2D& Pivot)//offset:0x2497BE0;
	void SetRenderTransformAngle(float Angle)//offset:0x2497B60;
	void SetRenderTransform(const struct FWidgetTransform& InTransform)//offset:0x2497A80;
	void SetRenderShear(const struct FVector2D& Shear)//offset:0x2497A00;
	void SetRenderScale(const struct FVector2D& Scale)//offset:0x2497980;
	void SetRenderOpacity(float InOpacity)//offset:0x2497900;
	void SetNavigationRuleExplicit(EUINavigation Direction, class UWidget* InWidget)//offset:0x24977A0;
	void SetNavigationRuleCustomBoundary(EUINavigation Direction, const struct FScriptDelegate& InCustomDelegate)//offset:0x24976B0;
	void SetNavigationRuleCustom(EUINavigation Direction, const struct FScriptDelegate& InCustomDelegate)//offset:0x24975C0;
	void SetNavigationRuleBase(EUINavigation Direction, EUINavigationRule Rule)//offset:0x24974F0;
	void SetNavigationRule(EUINavigation Direction, EUINavigationRule Rule, const struct FName& WidgetToFocus)//offset:0x24973E0;
	void SetKeyboardFocus()//offset:0x24973C0;
	void SetIsEnabled(bool bInIsEnabled)//offset:0x2497330;
	void SetFocus()//offset:0x2497290;
	void SetCursor(TEnumAsByte<EMouseCursor> InCursor)//offset:0x2497210;
	void SetClipping(EWidgetClipping InClipping)//offset:0x2497190;
	void SetAllNavigationRules(EUINavigationRule Rule, const struct FName& WidgetToFocus)//offset:0x24970C0;
	void ResetCursor()//offset:0x24970A0;
	void RemoveFromParent()//offset:0xF54860;
	struct FEventReply OnReply__DelegateSignature()//offset:0x13CEB30;
	struct FEventReply OnPointerEvent__DelegateSignature(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)//offset:0x13CEB30;
	bool IsVisible()//offset:0x2497070;
	bool IsHovered()//offset:0x1F58020;
	void InvalidateLayoutAndVolatility()//offset:0x2497050;
	bool HasUserFocusedDescendants(class APlayerController* PlayerController)//offset:0x2496FB0;
	bool HasUserFocus(class APlayerController* PlayerController)//offset:0x2496F10;
	bool HasMouseCaptureByUser(int UserIndex, int PointerIndex)//offset:0x2496E40;
	bool HasMouseCapture()//offset:0x2496E10;
	bool HasKeyboardFocus()//offset:0x2496DE0;
	bool HasFocusedDescendants()//offset:0x2496DB0;
	bool HasAnyUserFocus()//offset:0x2496D80;
	class UWidget* GetWidget__DelegateSignature()//offset:0x13CEB30;
	ESlateVisibility GetVisibility()//offset:0x2496D50;
	struct FGeometry GetTickSpaceGeometry()//offset:0x2496C30;
	struct FText GetText__DelegateSignature()//offset:0x13CEB30;
	ESlateVisibility GetSlateVisibility__DelegateSignature()//offset:0x13CEB30;
	struct FSlateColor GetSlateColor__DelegateSignature()//offset:0x13CEB30;
	struct FSlateBrush GetSlateBrush__DelegateSignature()//offset:0x13CEB30;
	float GetRenderTransformAngle()//offset:0x2496BD0;
	struct FVector2D GetRenderScale()//offset:0x2496B90;
	float GetRenderOpacity()//offset:0x2496B60;
	class UPanelWidget* GetParent()//offset:0x2496B30;
	struct FGeometry GetPaintSpaceGeometry()//offset:0x2496AF0;
	class APlayerController* GetOwningPlayer()//offset:0x2496AC0;
	class ULocalPlayer* GetOwningLocalPlayer()//offset:0x2496A90;
	TEnumAsByte<EMouseCursor> GetMouseCursor__DelegateSignature()//offset:0x13CEB30;
	struct FLinearColor GetLinearColor__DelegateSignature()//offset:0x13CEB30;
	bool GetIsEnabled()//offset:0x2496A60;
	int GetInt32__DelegateSignature()//offset:0x13CEB30;
	class UGameInstance* GetGameInstance()//offset:0x2496A30;
	float GetFloat__DelegateSignature()//offset:0x13CEB30;
	struct FVector2D GetDesiredSize()//offset:0x24969C0;
	EWidgetClipping GetClipping()//offset:0x2496990;
	ECheckBoxState GetCheckBoxState__DelegateSignature()//offset:0x13CEB30;
	struct FGeometry GetCachedGeometry()//offset:0x2496950;
	bool GetBool__DelegateSignature()//offset:0x13CEB30;
	struct FText GetAccessibleText()//offset:0x24968B0;
	struct FText GetAccessibleSummaryText()//offset:0x2496810;
	class UWidget* GenerateWidgetForString__DelegateSignature(const class FString& Item)//offset:0x13CEB30;
	class UWidget* GenerateWidgetForObject__DelegateSignature(class UObject* Item)//offset:0x13CEB30;
	void ForceVolatile(bool bForce)//offset:0x2496780;
	void ForceLayoutPrepass()//offset:0x2496760;
};


// Class UMG.UserWidget
// size:0x0158 (0x0108 - 0x0260)
class UUserWidget : public UWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0108(0x0008) MISSED OFFSET
	struct FLinearColor                                ColorAndOpacity;                                          // 0x0110(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ColorAndOpacityDelegate;                                  // 0x0120(0x0014) (ZeroConstructor, InstancedReference)
	struct FSlateColor                                 ForegroundColor;                                          // 0x0130(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             ForegroundColorDelegate;                                  // 0x0158(0x0014) (ZeroConstructor, InstancedReference)
	struct UEMulticastInlineDelegate                   OnVisibilityChanged;                                      // 0x0168(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0178(0x0018) MISSED OFFSET
	struct FMargin                                     Padding;                                                  // 0x0190(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<class UUMGSequencePlayer*>                  ActiveSequencePlayers;                                    // 0x01A0(0x0010) (ZeroConstructor, Transient)
	class UUMGSequenceTickManager*                     AnimationTickManager;                                     // 0x01B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class UUMGSequencePlayer*>                  StoppedSequencePlayers;                                   // 0x01B8(0x0010) (ZeroConstructor, Transient)
	TArray<struct FNamedSlotBinding>                   NamedSlotBindings;                                        // 0x01C8(0x0010) (ZeroConstructor)
	class UWidgetTree*                                 WidgetTree;                                               // 0x01D8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                Priority;                                                 // 0x01E0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bSupportsKeyboardFocus;                                   // 0x01E4(0x0001) (Deprecated)
	unsigned char                                      bIsFocusable;                                             // 0x01E4(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bStopAction;                                              // 0x01E4(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bHasScriptImplementedTick;                                // 0x01E4(0x0001)
	unsigned char                                      bHasScriptImplementedPaint;                               // 0x01E4(0x0001)
	unsigned char                                      UnknownData02[0xB];                                       // 0x01E5(0x000B) MISSED OFFSET
	EWidgetTickFrequency                               TickFrequency;                                            // 0x01F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x01F1(0x0007) MISSED OFFSET
	class UInputComponent*                             InputComponent;                                           // 0x01F8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData)
	TArray<struct FAnimationEventBinding>              AnimationCallbacks;                                       // 0x0200(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	unsigned char                                      UnknownData04[0x50];                                      // 0x0210(0x0050) MISSED OFFSET

	void UnregisterInputComponent()//offset:0x2494880;
	void UnbindFromAnimationStarted(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate)//offset:0x24947A0;
	void UnbindFromAnimationFinished(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate)//offset:0x24946C0;
	void UnbindAllFromAnimationStarted(class UWidgetAnimation* Animation)//offset:0x2494630;
	void UnbindAllFromAnimationFinished(class UWidgetAnimation* Animation)//offset:0x24945A0;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)//offset:0x13CEB30;
	void StopListeningForInputAction(const struct FName& ActionName, TEnumAsByte<EInputEvent> EventType)//offset:0x24944D0;
	void StopListeningForAllInputActions()//offset:0x24944B0;
	void StopAnimationsAndLatentActions()//offset:0x2494490;
	void StopAnimation(class UWidgetAnimation* InAnimation)//offset:0x2494400;
	void StopAllAnimations()//offset:0x24943E0;
	void SetPositionInViewport(const struct FVector2D& Position, bool bRemoveDPIScale)//offset:0x24940E0;
	void SetPlaybackSpeed(class UWidgetAnimation* InAnimation, float PlaybackSpeed)//offset:0x2494010;
	void SetPadding(const struct FMargin& InPadding)//offset:0x2493F80;
	void SetOwningPlayer(class APlayerController* LocalPlayerController)//offset:0x2493EF0;
	void SetNumLoopsToPlay(class UWidgetAnimation* InAnimation, int NumLoopsToPlay)//offset:0x2493E20;
	void SetInputActionPriority(int NewPriority)//offset:0x2493BC0;
	void SetInputActionBlocking(bool bShouldBlock)//offset:0x2493B30;
	void SetForegroundColor(const struct FSlateColor& InForegroundColor)//offset:0x24939C0;
	void SetDesiredSizeInViewport(const struct FVector2D& Size)//offset:0x2493940;
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity)//offset:0x2493820;
	void SetAnimationCurrentTime(class UWidgetAnimation* InAnimation, float InTime)//offset:0x2493750;
	void SetAnchorsInViewport(const struct FAnchors& Anchors)//offset:0x24936C0;
	void SetAlignmentInViewport(const struct FVector2D& Alignment)//offset:0x2493640;
	void ReverseAnimation(class UWidgetAnimation* InAnimation)//offset:0x24935B0;
	void RemoveFromViewport()//offset:0x2493590;
	void RegisterInputComponent()//offset:0x2493570;
	void PreConstruct(bool IsDesignTime)//offset:0x13CEB30;
	void PlaySound(class USoundBase* SoundToPlay)//offset:0x24934E0;
	class UUMGSequencePlayer* PlayAnimationTimeRange(class UWidgetAnimation* InAnimation, float StartAtTime, float EndAtTime, int NumLoopsToPlay, TEnumAsByte<EUMGSequencePlayMode> PlayMode, float PlaybackSpeed, bool bRestoreState)//offset:0x24932C0;
	class UUMGSequencePlayer* PlayAnimationReverse(class UWidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState)//offset:0x24931A0;
	class UUMGSequencePlayer* PlayAnimationForward(class UWidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState)//offset:0x2493080;
	class UUMGSequencePlayer* PlayAnimation(class UWidgetAnimation* InAnimation, float StartAtTime, int NumLoopsToPlay, TEnumAsByte<EUMGSequencePlayMode> PlayMode, float PlaybackSpeed, bool bRestoreState)//offset:0x2492EB0;
	float PauseAnimation(class UWidgetAnimation* InAnimation)//offset:0x2492E10;
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent)//offset:0x13CEB30;
	struct FEventReply OnTouchMoved(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent)//offset:0x13CEB30;
	struct FEventReply OnTouchGesture(const struct FGeometry& MyGeometry, const struct FPointerEvent& GestureEvent)//offset:0x13CEB30;
	struct FEventReply OnTouchForceChanged(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent)//offset:0x13CEB30;
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent)//offset:0x13CEB30;
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent)//offset:0x13CEB30;
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)//offset:0x13CEB30;
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent)//offset:0x13CEB30;
	void OnPaint(struct FPaintContext* Context)//offset:0x13CEB30;
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)//offset:0x13CEB30;
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)//offset:0x13CEB30;
	void OnMouseLeave(const struct FPointerEvent& MouseEvent)//offset:0x13CEB30;
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)//offset:0x13CEB30;
	void OnMouseCaptureLost()//offset:0x13CEB30;
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)//offset:0x13CEB30;
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)//offset:0x13CEB30;
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent)//offset:0x13CEB30;
	struct FEventReply OnMotionDetected(const struct FGeometry& MyGeometry, const struct FMotionEvent& InMotionEvent)//offset:0x13CEB30;
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent)//offset:0x13CEB30;
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent)//offset:0x13CEB30;
	struct FEventReply OnKeyChar(const struct FGeometry& MyGeometry, const struct FCharacterEvent& InCharacterEvent)//offset:0x13CEB30;
	void OnInitialized()//offset:0x13CEB30;
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent)//offset:0x13CEB30;
	void OnFocusLost(const struct FFocusEvent& InFocusEvent)//offset:0x13CEB30;
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation)//offset:0x13CEB30;
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation)//offset:0x13CEB30;
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation)//offset:0x13CEB30;
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation)//offset:0x13CEB30;
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation)//offset:0x13CEB30;
	void OnDragCancelled(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation)//offset:0x13CEB30;
	void OnAnimationStarted(class UWidgetAnimation* Animation)//offset:0x2492D80;
	void OnAnimationFinished(class UWidgetAnimation* Animation)//offset:0x2492CF0;
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent)//offset:0x13CEB30;
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent)//offset:0x13CEB30;
	void ListenForInputAction(const struct FName& ActionName, TEnumAsByte<EInputEvent> EventType, bool bConsume, const struct FScriptDelegate& Callback)//offset:0x2492B60;
	bool IsPlayingAnimation()//offset:0x2492B30;
	bool IsListeningForInputAction(const struct FName& ActionName)//offset:0x2492A90;
	bool IsInViewport()//offset:0x2492840;
	bool IsInteractable()//offset:0x13CEB30;
	bool IsAnyAnimationPlaying()//offset:0x2492A60;
	bool IsAnimationPlayingForward(class UWidgetAnimation* InAnimation)//offset:0x24929C0;
	bool IsAnimationPlaying(class UWidgetAnimation* InAnimation)//offset:0x2492920;
	class APlayerState* GetOwningPlayerState()//offset:0x24928D0;
	class APawn* GetOwningPlayerPawn()//offset:0x24928A0;
	class APlayerCameraManager* GetOwningPlayerCameraManager()//offset:0x2492870;
	bool GetIsVisible()//offset:0x2492840;
	float GetAnimationCurrentTime(class UWidgetAnimation* InAnimation)//offset:0x24927A0;
	struct FAnchors GetAnchorsInViewport()//offset:0x2492760;
	struct FVector2D GetAlignmentInViewport()//offset:0x2492720;
	void FlushAnimations()//offset:0x2492700;
	void Destruct()//offset:0x13CEB30;
	void Construct()//offset:0x13CEB30;
	void CancelLatentActions()//offset:0x24926A0;
	void BindToAnimationStarted(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate)//offset:0x24925C0;
	void BindToAnimationFinished(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate)//offset:0x24924E0;
	void BindToAnimationEvent(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate, EWidgetAnimationEvent AnimationEvent, const struct FName& UserTag)//offset:0x2492360;
	void AddToViewport(int ZOrder)//offset:0x24922D0;
	bool AddToPlayerScreen(int ZOrder)//offset:0x2492230;
};


// Class UMG.RichTextBlockDecorator
// size:0x0000 (0x0028 - 0x0028)
class URichTextBlockDecorator : public UObject
{
public:
};


// Class UMG.PanelWidget
// size:0x0018 (0x0108 - 0x0120)
class UPanelWidget : public UWidget
{
public:
	TArray<class UPanelSlot*>                          Slots;                                                    // 0x0108(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0118(0x0008) MISSED OFFSET

	bool RemoveChildAt(int Index)//offset:0x2483810;
	bool RemoveChild(class UWidget* Content)//offset:0x2483770;
	bool HasChild(class UWidget* Content)//offset:0x24835E0;
	bool HasAnyChildren()//offset:0x24835B0;
	int GetChildrenCount()//offset:0x2483260;
	int GetChildIndex(class UWidget* Content)//offset:0x24831C0;
	class UWidget* GetChildAt(int Index)//offset:0x2483120;
	TArray<class UWidget*> GetAllChildren()//offset:0x24830A0;
	void ClearChildren()//offset:0x2482FD0;
	class UPanelSlot* AddChild(class UWidget* Content)//offset:0x2482E90;
};


// Class UMG.PanelSlot
// size:0x0010 (0x0028 - 0x0038)
class UPanelSlot : public UVisual
{
public:
	class UPanelWidget*                                Parent;                                                   // 0x0028(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidget*                                     Content;                                                  // 0x0030(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};


// Class UMG.AsyncTaskDownloadImage
// size:0x0020 (0x0030 - 0x0050)
class UAsyncTaskDownloadImage : public UBlueprintAsyncActionBase
{
public:
	struct UEMulticastInlineDelegate                   OnSuccess;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnFail;                                                   // 0x0040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static class UAsyncTaskDownloadImage* DownloadImage(const class FString& URL)//offset:0x24759A0;
};


// Class UMG.ContentWidget
// size:0x0000 (0x0120 - 0x0120)
class UContentWidget : public UPanelWidget
{
public:

	class UPanelSlot* SetContent(class UWidget* Content)//offset:0x247ABF0;
	class UPanelSlot* GetContentSlot()//offset:0x247A460;
	class UWidget* GetContent()//offset:0x247A430;
};


// Class UMG.BackgroundBlur
// size:0x00B8 (0x0120 - 0x01D8)
class UBackgroundBlur : public UContentWidget
{
public:
	struct FMargin                                     Padding;                                                  // 0x0120(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EHorizontalAlignment>                  HorizontalAlignment;                                      // 0x0130(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EVerticalAlignment>                    VerticalAlignment;                                        // 0x0131(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bApplyAlphaToBlur;                                        // 0x0132(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0133(0x0001) MISSED OFFSET
	float                                              BlurStrength;                                             // 0x0134(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideAutoRadiusCalculation;                           // 0x0138(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0139(0x0003) MISSED OFFSET
	int                                                BlurRadius;                                               // 0x013C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FSlateBrush                                 LowQualityFallbackBrush;                                  // 0x0140(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData02[0x10];                                      // 0x01C8(0x0010) MISSED OFFSET

	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment)//offset:0x2477820;
	void SetPadding(const struct FMargin& InPadding)//offset:0x2477070;
	void SetLowQualityFallbackBrush(const struct FSlateBrush& InBrush)//offset:0x2476CE0;
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment)//offset:0x2476930;
	void SetBlurStrength(float InStrength)//offset:0x24761D0;
	void SetBlurRadius(int InBlurRadius)//offset:0x2476140;
	void SetApplyAlphaToBlur(bool bInApplyAlphaToBlur)//offset:0x2475F90;
};


// Class UMG.BackgroundBlurSlot
// size:0x0028 (0x0038 - 0x0060)
class UBackgroundBlurSlot : public UPanelSlot
{
public:
	struct FMargin                                     Padding;                                                  // 0x0038(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EHorizontalAlignment>                  HorizontalAlignment;                                      // 0x0048(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EVerticalAlignment>                    VerticalAlignment;                                        // 0x0049(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x16];                                      // 0x004A(0x0016) MISSED OFFSET

	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment)//offset:0x24778A0;
	void SetPadding(const struct FMargin& InPadding)//offset:0x2477100;
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment)//offset:0x24769B0;
};


// Class UMG.PropertyBinding
// size:0x0038 (0x0028 - 0x0060)
class UPropertyBinding : public UObject
{
public:
	TWeakObjectPtr<class UObject>                      SourceObject;                                             // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FDynamicPropertyPath                        SourcePath;                                               // 0x0030(0x0028)
	struct FName                                       DestinationProperty;                                      // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
};


// Class UMG.BoolBinding
// size:0x0000 (0x0060 - 0x0060)
class UBoolBinding : public UPropertyBinding
{
public:

	bool GetValue()//offset:0x2475CB0;
};


// Class UMG.Border
// size:0x0150 (0x0120 - 0x0270)
class UBorder : public UContentWidget
{
public:
	TEnumAsByte<EHorizontalAlignment>                  HorizontalAlignment;                                      // 0x0120(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EVerticalAlignment>                    VerticalAlignment;                                        // 0x0121(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bShowEffectWhenDisabled;                                  // 0x0122(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0123(0x0001) MISSED OFFSET
	struct FLinearColor                                ContentColorAndOpacity;                                   // 0x0124(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ContentColorAndOpacityDelegate;                           // 0x0134(0x0014) (ZeroConstructor, InstancedReference)
	struct FMargin                                     Padding;                                                  // 0x0144(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0154(0x0004) MISSED OFFSET
	struct FSlateBrush                                 Background;                                               // 0x0158(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             BackgroundDelegate;                                       // 0x01E0(0x0014) (ZeroConstructor, InstancedReference)
	struct FLinearColor                                BrushColor;                                               // 0x01F0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             BrushColorDelegate;                                       // 0x0200(0x0014) (ZeroConstructor, InstancedReference)
	struct FVector2D                                   DesiredSizeScale;                                         // 0x0210(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bFlipForRightToLeftFlowDirection;                         // 0x0218(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0219(0x0003) MISSED OFFSET
	struct FScriptDelegate                             OnMouseButtonDownEvent;                                   // 0x021C(0x0014) (Edit, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnMouseButtonUpEvent;                                     // 0x022C(0x0014) (Edit, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnMouseMoveEvent;                                         // 0x023C(0x0014) (Edit, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnMouseDoubleClickEvent;                                  // 0x024C(0x0014) (Edit, ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData03[0x14];                                      // 0x025C(0x0014) MISSED OFFSET

	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment)//offset:0x2477920;
	void SetPadding(const struct FMargin& InPadding)//offset:0x2477190;
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment)//offset:0x2476A30;
	void SetDesiredSizeScale(const struct FVector2D& InScale)//offset:0x24768B0;
	void SetContentColorAndOpacity(const struct FLinearColor& InContentColorAndOpacity)//offset:0x2476820;
	void SetBrushFromTexture(class UTexture2D* Texture)//offset:0x2476580;
	void SetBrushFromObject(class UObject* Object)//offset:0x2476580;
	void SetBrushFromMaterial(class UMaterialInterface* Material)//offset:0x24764F0;
	void SetBrushFromAsset(class USlateBrushAsset* Asset)//offset:0x2476460;
	void SetBrushColor(const struct FLinearColor& InBrushColor)//offset:0x24763D0;
	void SetBrush(const struct FSlateBrush& InBrush)//offset:0x2476260;
	class UMaterialInstanceDynamic* GetDynamicMaterial()//offset:0x2475B70;
};


// Class UMG.BorderSlot
// size:0x0028 (0x0038 - 0x0060)
class UBorderSlot : public UPanelSlot
{
public:
	struct FMargin                                     Padding;                                                  // 0x0038(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EHorizontalAlignment>                  HorizontalAlignment;                                      // 0x0048(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EVerticalAlignment>                    VerticalAlignment;                                        // 0x0049(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x16];                                      // 0x004A(0x0016) MISSED OFFSET

	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment)//offset:0x24779A0;
	void SetPadding(const struct FMargin& InPadding)//offset:0x2477220;
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment)//offset:0x2476AB0;
};


// Class UMG.BrushBinding
// size:0x0008 (0x0060 - 0x0068)
class UBrushBinding : public UPropertyBinding
{
public:

	struct FSlateBrush GetValue()//offset:0x2475CE0;
};


// Class UMG.Button
// size:0x0308 (0x0120 - 0x0428)
class UButton : public UContentWidget
{
public:
	class USlateWidgetStyleAsset*                      Style;                                                    // 0x0120(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	struct FButtonStyle                                WidgetStyle;                                              // 0x0128(0x0278) (Edit, BlueprintVisible)
	struct FLinearColor                                ColorAndOpacity;                                          // 0x03A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                BackgroundColor;                                          // 0x03B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonClickMethod>                    ClickMethod;                                              // 0x03C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonTouchMethod>                    TouchMethod;                                              // 0x03C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonPressMethod>                    PressMethod;                                              // 0x03C2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsFocusable;                                              // 0x03C3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03C4(0x0004) MISSED OFFSET
	struct UEMulticastInlineDelegate                   OnClicked;                                                // 0x03C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnPressed;                                                // 0x03D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnReleased;                                               // 0x03E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnHovered;                                                // 0x03F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnUnhovered;                                              // 0x0408(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0418(0x0010) MISSED OFFSET

	void SetTouchMethod(TEnumAsByte<EButtonTouchMethod> InTouchMethod)//offset:0x2477720;
	void SetStyle(const struct FButtonStyle& InStyle)//offset:0x2477640;
	void SetPressMethod(TEnumAsByte<EButtonPressMethod> InPressMethod)//offset:0x2477440;
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity)//offset:0x2476790;
	void SetClickMethod(TEnumAsByte<EButtonClickMethod> InClickMethod)//offset:0x2476690;
	void SetBackgroundColor(const struct FLinearColor& InBackgroundColor)//offset:0x24760B0;
	bool IsPressed()//offset:0x2475E20;
};


// Class UMG.ButtonSlot
// size:0x0028 (0x0038 - 0x0060)
class UButtonSlot : public UPanelSlot
{
public:
	struct FMargin                                     Padding;                                                  // 0x0038(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EHorizontalAlignment>                  HorizontalAlignment;                                      // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EVerticalAlignment>                    VerticalAlignment;                                        // 0x0049(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x16];                                      // 0x004A(0x0016) MISSED OFFSET

	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment)//offset:0x2477A20;
	void SetPadding(const struct FMargin& InPadding)//offset:0x24772B0;
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment)//offset:0x2476B30;
};


// Class UMG.CanvasPanel
// size:0x0010 (0x0120 - 0x0130)
class UCanvasPanel : public UPanelWidget
{
public:

	class UCanvasPanelSlot* AddChildToCanvas(class UWidget* Content)//offset:0x2475900;
};


// Class UMG.CanvasPanelSlot
// size:0x0038 (0x0038 - 0x0070)
class UCanvasPanelSlot : public UPanelSlot
{
public:
	struct FAnchorData                                 LayoutData;                                               // 0x0038(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bAutoSize;                                                // 0x0060(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	int                                                ZOrder;                                                   // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0068(0x0008) MISSED OFFSET

	void SetZOrder(int InZOrder)//offset:0x2477AA0;
	void SetSize(const struct FVector2D& InSize)//offset:0x24775C0;
	void SetPosition(const struct FVector2D& InPosition)//offset:0x24773C0;
	void SetOffsets(const struct FMargin& InOffset)//offset:0x2476FE0;
	void SetMinimum(const struct FVector2D& InMinimumAnchors)//offset:0x2476ED0;
	void SetMaximum(const struct FVector2D& InMaximumAnchors)//offset:0x2476E50;
	void SetLayout(const struct FAnchorData& InLayoutData)//offset:0x2476C40;
	void SetAutoSize(bool InbAutoSize)//offset:0x2476020;
	void SetAnchors(const struct FAnchors& InAnchors)//offset:0x2475F00;
	void SetAlignment(const struct FVector2D& InAlignment)//offset:0x2475E80;
	int GetZOrder()//offset:0x2475DC0;
	struct FVector2D GetSize()//offset:0x2475C70;
	struct FVector2D GetPosition()//offset:0x2475C30;
	struct FMargin GetOffsets()//offset:0x2475BF0;
	struct FAnchorData GetLayout()//offset:0x2475BA0;
	bool GetAutoSize()//offset:0x2475B10;
	struct FAnchors GetAnchors()//offset:0x2475AD0;
	struct FVector2D GetAlignment()//offset:0x2475A90;
};


// Class UMG.CheckBox
// size:0x0650 (0x0120 - 0x0770)
class UCheckBox : public UContentWidget
{
public:
	ECheckBoxState                                     CheckedState;                                             // 0x0120(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0121(0x0003) MISSED OFFSET
	struct FScriptDelegate                             CheckedStateDelegate;                                     // 0x0124(0x0014) (ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0134(0x0004) MISSED OFFSET
	struct FCheckBoxStyle                              WidgetStyle;                                              // 0x0138(0x0580) (Edit, BlueprintVisible)
	class USlateWidgetStyleAsset*                      Style;                                                    // 0x06B8(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            UncheckedImage;                                           // 0x06C0(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            UncheckedHoveredImage;                                    // 0x06C8(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            UncheckedPressedImage;                                    // 0x06D0(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            CheckedImage;                                             // 0x06D8(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            CheckedHoveredImage;                                      // 0x06E0(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            CheckedPressedImage;                                      // 0x06E8(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            UndeterminedImage;                                        // 0x06F0(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            UndeterminedHoveredImage;                                 // 0x06F8(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateBrushAsset*                            UndeterminedPressedImage;                                 // 0x0700(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	TEnumAsByte<EHorizontalAlignment>                  HorizontalAlignment;                                      // 0x0708(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0709(0x0003) MISSED OFFSET
	struct FMargin                                     Padding;                                                  // 0x070C(0x0010) (ZeroConstructor, Deprecated, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x071C(0x0004) MISSED OFFSET
	struct FSlateColor                                 BorderBackgroundColor;                                    // 0x0720(0x0028) (Deprecated)
	TEnumAsByte<EButtonClickMethod>                    ClickMethod;                                              // 0x0748(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonTouchMethod>                    TouchMethod;                                              // 0x0749(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonPressMethod>                    PressMethod;                                              // 0x074A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsFocusable;                                              // 0x074B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x074C(0x0004) MISSED OFFSET
	struct UEMulticastInlineDelegate                   OnCheckStateChanged;                                      // 0x0750(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData05[0x10];                                      // 0x0760(0x0010) MISSED OFFSET

	void SetTouchMethod(TEnumAsByte<EButtonTouchMethod> InTouchMethod)//offset:0x24777A0;
	void SetPressMethod(TEnumAsByte<EButtonPressMethod> InPressMethod)//offset:0x24774C0;
	void SetIsChecked(bool InIsChecked)//offset:0x2476BB0;
	void SetClickMethod(TEnumAsByte<EButtonClickMethod> InClickMethod)//offset:0x2476710;
	void SetCheckedState(ECheckBoxState InCheckedState)//offset:0x2476610;
	bool IsPressed()//offset:0x2475E50;
	bool IsChecked()//offset:0x2475DF0;
	ECheckBoxState GetCheckedState()//offset:0x2475B40;
};


// Class UMG.CheckedStateBinding
// size:0x0008 (0x0060 - 0x0068)
class UCheckedStateBinding : public UPropertyBinding
{
public:

	ECheckBoxState GetValue()//offset:0x2475D90;
};


// Class UMG.CircularThrobber
// size:0x00B8 (0x0108 - 0x01C0)
class UCircularThrobber : public UWidget
{
public:
	int                                                NumberOfPieces;                                           // 0x0108(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Period;                                                   // 0x010C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Radius;                                                   // 0x0110(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0114(0x0004) MISSED OFFSET
	class USlateBrushAsset*                            PieceImage;                                               // 0x0118(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	struct FSlateBrush                                 Image;                                                    // 0x0120(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bEnableRadius;                                            // 0x01A8(0x0001) (Edit, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x17];                                      // 0x01A9(0x0017) MISSED OFFSET

	void SetRadius(float InRadius)//offset:0x2477540;
	void SetPeriod(float InPeriod)//offset:0x2477340;
	void SetNumberOfPieces(int InNumberOfPieces)//offset:0x2476F50;
};


// Class UMG.ColorBinding
// size:0x0008 (0x0060 - 0x0068)
class UColorBinding : public UPropertyBinding
{
public:

	struct FSlateColor GetSlateValue()//offset:0x247A6F0;
	struct FLinearColor GetLinearValue()//offset:0x247A4C0;
};


// Class UMG.ComboBox
// size:0x0038 (0x0108 - 0x0140)
class UComboBox : public UWidget
{
public:
	TArray<class UObject*>                             Items;                                                    // 0x0108(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FScriptDelegate                             OnGenerateWidgetEvent;                                    // 0x0118(0x0014) (Edit, ZeroConstructor, InstancedReference)
	bool                                               bIsFocusable;                                             // 0x0128(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0129(0x0017) MISSED OFFSET
};


// Class UMG.ComboBoxString
// size:0x0CF8 (0x0108 - 0x0E00)
class UComboBoxString : public UWidget
{
public:
	TArray<class FString>                              DefaultOptions;                                           // 0x0108(0x0010) (Edit, ZeroConstructor)
	class FString                                      SelectedOption;                                           // 0x0118(0x0010) (Edit, ZeroConstructor)
	struct FComboBoxStyle                              WidgetStyle;                                              // 0x0128(0x03F0) (Edit, BlueprintVisible)
	struct FTableRowStyle                              ItemStyle;                                                // 0x0518(0x07C8) (Edit, BlueprintVisible)
	struct FMargin                                     ContentPadding;                                           // 0x0CE0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxListHeight;                                            // 0x0CF0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               HasDownArrow;                                             // 0x0CF4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               EnableGamepadNavigationMode;                              // 0x0CF5(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0CF6(0x0002) MISSED OFFSET
	struct FSlateFontInfo                              Font;                                                     // 0x0CF8(0x0058) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateColor                                 ForegroundColor;                                          // 0x0D50(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bIsFocusable;                                             // 0x0D78(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0D79(0x0003) MISSED OFFSET
	struct FScriptDelegate                             OnGenerateWidgetEvent;                                    // 0x0D7C(0x0014) (Edit, ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0D8C(0x0004) MISSED OFFSET
	struct UEMulticastInlineDelegate                   OnSelectionChanged;                                       // 0x0D90(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnOpening;                                                // 0x0DA0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x50];                                      // 0x0DB0(0x0050) MISSED OFFSET

	void SetSelectedOption(const class FString& Option)//offset:0x247B620;
	void SetSelectedIndex(int Index)//offset:0x247B590;
	bool RemoveOption(const class FString& Option)//offset:0x247A9E0;
	void RefreshOptions()//offset:0x247A930;
	void OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, TEnumAsByte<ESelectInfo> SelectionType)//offset:0x13CEB30;
	void OnOpeningEvent__DelegateSignature()//offset:0x13CEB30;
	bool IsOpen()//offset:0x247A900;
	class FString GetSelectedOption()//offset:0x247A670;
	int GetSelectedIndex()//offset:0x247A640;
	int GetOptionCount()//offset:0x247A610;
	class FString GetOptionAtIndex(int Index)//offset:0x247A530;
	int FindOptionIndex(const class FString& Option)//offset:0x247A2F0;
	void ClearSelection()//offset:0x2479F40;
	void ClearOptions()//offset:0x2479F20;
	void AddOption(const class FString& Option)//offset:0x2479D90;
};


// Class UMG.DragDropOperation
// size:0x0060 (0x0028 - 0x0088)
class UDragDropOperation : public UObject
{
public:
	class FString                                      Tag;                                                      // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UObject*                                     Payload;                                                  // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UWidget*                                     DefaultDragVisual;                                        // 0x0040(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	EDragPivot                                         Pivot;                                                    // 0x0048(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0049(0x0003) MISSED OFFSET
	struct FVector2D                                   Offset;                                                   // 0x004C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	struct UEMulticastInlineDelegate                   OnDrop;                                                   // 0x0058(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnDragCancelled;                                          // 0x0068(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnDragged;                                                // 0x0078(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	void Drop(const struct FPointerEvent& PointerEvent)//offset:0x247A1C0;
	void Dragged(const struct FPointerEvent& PointerEvent)//offset:0x247A090;
	void DragCancelled(const struct FPointerEvent& PointerEvent)//offset:0x2479F60;
};


// Class UMG.DynamicEntryBoxBase
// size:0x00D0 (0x0108 - 0x01D8)
class UDynamicEntryBoxBase : public UWidget
{
public:
	EDynamicBoxType                                    EntryBoxType;                                             // 0x0108(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0109(0x0003) MISSED OFFSET
	struct FVector2D                                   EntrySpacing;                                             // 0x010C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0114(0x0004) MISSED OFFSET
	TArray<struct FVector2D>                           SpacingPattern;                                           // 0x0118(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FSlateChildSize                             EntrySizeRule;                                            // 0x0128(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<EHorizontalAlignment>                  EntryHorizontalAlignment;                                 // 0x0130(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EVerticalAlignment>                    EntryVerticalAlignment;                                   // 0x0131(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0132(0x0002) MISSED OFFSET
	int                                                MaxElementSize;                                           // 0x0134(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRadialBoxSettings                          RadialBoxSettings;                                        // 0x0138(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData03[0x14];                                      // 0x0144(0x0014) MISSED OFFSET
	struct FUserWidgetPool                             EntryWidgetPool;                                          // 0x0158(0x0080) (Transient)

	void SetRadialSettings(const struct FRadialBoxSettings& InSettings)//offset:0x247B420;
	void SetEntrySpacing(const struct FVector2D& InEntrySpacing)//offset:0x247AC90;
	int GetNumEntries()//offset:0x247A500;
	TArray<class UUserWidget*> GetAllEntries()//offset:0x247A3A0;
};


// Class UMG.DynamicEntryBox
// size:0x0008 (0x01D8 - 0x01E0)
class UDynamicEntryBox : public UDynamicEntryBoxBase
{
public:
	class UUserWidget*                                 EntryWidgetClass;                                         // 0x01D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	void Reset(bool bDeleteWidgets)//offset:0x247AA90;
	void RemoveEntry(class UUserWidget* EntryWidget)//offset:0x247A950;
	class UUserWidget* BP_CreateEntryOfClass(class UUserWidget* EntryClass)//offset:0x2479E60;
	class UUserWidget* BP_CreateEntry()//offset:0x2479E30;
};


// Class UMG.EditableText
// size:0x0358 (0x0108 - 0x0460)
class UEditableText : public UWidget
{
public:
