#pragma once

// DreadHunger-Win64-Shipping SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DreadHunger-Win64-Shipping_DreadHunger_structs.hpp"

//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class DreadHunger.DH_ActiveDebugControls
// size:0x0000 (0x0260 - 0x0260)
class UDH_ActiveDebugControls : public UUserWidget
{
public:

	class FString SetTOD(float Hour)//offset:0xF13E40;
};


// Class DreadHunger.DH_ActorRandomizationVolume
// size:0x0050 (0x0258 - 0x02A8)
class ADH_ActorRandomizationVolume : public AVolume
{
public:
	TMap<struct FName, struct FActorRandomizationGroup> ActorGroups;                                              // 0x0258(0x0050) (Edit, DisableEditOnTemplate)
};


// Class DreadHunger.DH_AIController
// size:0x00A8 (0x0328 - 0x03D0)
class ADH_AIController : public AAIController
{
public:
	TMap<class AActor*, float>                         ThreatTable;                                              // 0x0328(0x0050)
	class ADH_Character*                               TargetCharacter;                                          // 0x0378(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class ADH_Character*                               ControlledCharacter;                                      // 0x0380(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              UpdateTargetRate;                                         // 0x0388(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxDamageAggroRange;                                      // 0x038C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NoTargetUpdateTime;                                       // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0394(0x0004) MISSED OFFSET
	class UNavigationQueryFilter*                      ChaseFilter;                                              // 0x0398(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RandomizeTreatTableTime;                                  // 0x03A0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CharacterStuckTime;                                       // 0x03A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NewTargetSearchRange;                                     // 0x03A8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bMustHaveTarget;                                          // 0x03AC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bChaseTargetCharacter;                                    // 0x03AD(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bReactToDamage;                                           // 0x03AE(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x21];                                      // 0x03AF(0x0021) MISSED OFFSET

	void TargetCharacterDied(class ADH_Character* Target)//offset:0xF13F40;
	void OnTakeDamage(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser)//offset:0xF13A40;
	void OnCinematicModeChanged(bool bCinematicMode)//offset:0xF133D0;
	void ControlledCharacterDied(class ADH_Character* DeadCharacter)//offset:0xF13050;
	void AddTargetToThreatTable(class AActor* NewTarget, float ExtraThreat)//offset:0xF12F60;
};


// Class DreadHunger.DH_AIControllerHuman
// size:0x0000 (0x03D0 - 0x03D0)
class ADH_AIControllerHuman : public ADH_AIController
{
public:
};


// Class DreadHunger.DH_AIControllerWildlife
// size:0x0030 (0x03D0 - 0x0400)
class ADH_AIControllerWildlife : public ADH_AIController
{
public:
	bool                                               bAutoEnableSight;                                         // 0x03D0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x03D1(0x0003) MISSED OFFSET
	float                                              LeashRange;                                               // 0x03D4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RandomRoamRange;                                          // 0x03D8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SleepRange;                                               // 0x03DC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UNavigationQueryFilter*                      RoamingFilter;                                            // 0x03E0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_AnimalCharacter*                         ControlledAnimal;                                         // 0x03E8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x03F0(0x0010) MISSED OFFSET

	void SensedActor(class AActor* Actor, const struct FAIStimulus& Stimulus)//offset:0xF13CB0;
};


// Class DreadHunger.DH_AIControllerMonster
// size:0x0000 (0x0400 - 0x0400)
class ADH_AIControllerMonster : public ADH_AIControllerWildlife
{
public:
};


// Class DreadHunger.DH_AIControllerPredator
// size:0x0000 (0x0400 - 0x0400)
class ADH_AIControllerPredator : public ADH_AIControllerWildlife
{
public:
};


// Class DreadHunger.DH_AIControllerPrey
// size:0x0010 (0x0400 - 0x0410)
class ADH_AIControllerPrey : public ADH_AIControllerWildlife
{
public:
	class UEnvQuery*                                   RunAwayQueryTemplate;                                     // 0x0400(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0408(0x0008) MISSED OFFSET
};


// Class DreadHunger.DH_AIControllerWendigo
// size:0x00A8 (0x03D0 - 0x0478)
class ADH_AIControllerWendigo : public ADH_AIControllerHuman
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x03D0(0x0008) MISSED OFFSET
	class UEnvQuery*                                   RunAwayQueryTemplate;                                     // 0x03D8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UNavigationQueryFilter*                      RoamingFilter;                                            // 0x03E0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_ThrallTotem*                             TotemClass;                                               // 0x03E8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_TotemSpell*                              WendigoWalk;                                              // 0x03F0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_SpellManager*                            SpellManagerClass;                                        // 0x03F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_WendigoCharacter*                        ControlledWendigo;                                        // 0x0400(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0408(0x0010) MISSED OFFSET
	class ADH_SpellManager*                            SpellManager;                                             // 0x0418(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x58];                                      // 0x0420(0x0058) MISSED OFFSET
};


// Class DreadHunger.DH_AIPathSpline
// size:0x0090 (0x0220 - 0x02B0)
class ADH_AIPathSpline : public AActor
{
public:
	class ADH_Character*                               PathingAIClass;                                           // 0x0220(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLoop;                                                    // 0x0228(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPathOnSpawn;                                             // 0x0229(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldRun;                                               // 0x022A(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bInvincibleWhilePathing;                                  // 0x022B(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bProximityTriggered;                                      // 0x022C(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x022D(0x0003) MISSED OFFSET
	float                                              ProximityRadius;                                          // 0x0230(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              TurnSpeed;                                                // 0x0234(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0238(0x0008) MISSED OFFSET
	struct FTransform                                  SpawnTransform;                                           // 0x0240(0x0030) (Edit, DisableEditOnTemplate, IsPlainOldData)
	class UBillboardComponent*                         Sprite;                                                   // 0x0270(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USplineComponent*                            Spline;                                                   // 0x0278(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct UEMulticastInlineDelegate                   OnPathingFinished;                                        // 0x0280(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0290(0x0018) MISSED OFFSET
	class ADH_AIController*                            PathingAI;                                                // 0x02A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	void SpawnAI()//offset:0xF13F20;
	void OnStartedPathing()//offset:0x13CEB30;
	void OnPointReached(int PointIndex)//offset:0x13CEB30;
	void OnPathingCharacterDied(class ADH_Character* DeadCharacter)//offset:0xF13650;
	void OnPathingCharacterDestroyed(class AActor* DestroyedActor)//offset:0xF135C0;
	void OnMoveComplete(const struct FAIRequestID& RequestID, TEnumAsByte<EPathFollowingResult> Result)//offset:0xF134F0;
	void OnAISpawned(class ADH_Character* SpawnedAI)//offset:0x13CEB30;
	void MoveToPoint(int TargetPathIndex)//offset:0xF13340;
	void MoveToNextPoint()//offset:0xF13320;
	float GetProximityRadius(int InPathIndex)//offset:0xF13110;
	void BeginPathing()//offset:0xF13030;
};


// Class DreadHunger.DH_AIPointOfInterest
// size:0x0010 (0x0220 - 0x0230)
class ADH_AIPointOfInterest : public AActor
{
public:
	EAIPointOfInterest                                 Type;                                                     // 0x0220(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0221(0x0007) MISSED OFFSET
	class UBillboardComponent*                         SpriteComponent;                                          // 0x0228(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
};


// Class DreadHunger.DH_AISpawnManager
// size:0x00E0 (0x0220 - 0x0300)
class ADH_AISpawnManager : public AActor
{
public:
	class UBillboardComponent*                         Sprite;                                                   // 0x0220(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	EAISpawnMethod                                     SpawnMethod;                                              // 0x0228(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0229(0x0007) MISSED OFFSET
	class UEnvQuery*                                   QueryTemplate;                                            // 0x0230(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnRate;                                                // 0x0238(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x023C(0x0004) MISSED OFFSET
	class ADH_Character*                               SpawnClass;                                               // 0x0240(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	int                                                MaxConcurrentAI;                                          // 0x0248(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x024C(0x0004) MISSED OFFSET
	TArray<int>                                        MaxConcurrentAIByDaysLeft;                                // 0x0250(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	int                                                MaxTotalAISpawns;                                         // 0x0260(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              ActivationRange;                                          // 0x0264(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              LeashRange;                                               // 0x0268(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              RandomRoamRange;                                          // 0x026C(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData03[0x18];                                      // 0x0270(0x0018) MISSED OFFSET
	unsigned char                                      UnknownData04[0x50];                                      // 0x0270(0x0050) UNKNOWN PROPERTY: 
	unsigned char                                      UnknownData05[0x28];                                      // 0x02D8(0x0028) MISSED OFFSET

	void RemoveSpawnedCharacter(class ADH_Character* CharacterToRemove)//offset:0xF13C20;
	void QuerySpawnLocation()//offset:0xF13C00;
	void OnSpellExpired(class UDH_TotemSpell* Spell, ETotemSpellTiers CastTier)//offset:0xF138A0;
	void OnSpellCast(class UDH_TotemSpell* Spell, ETotemSpellTiers CastTier)//offset:0xF13700;
	void OnDaysUntilBlizzardChanged(class ADH_GameState* InGameState)//offset:0xF13460;
};


// Class DreadHunger.DH_AITarget
// size:0x0000 (0x0028 - 0x0028)
class UDH_AITarget : public UInterface
{
public:

	bool IsAITargetable()//offset:0xF13250;
	float GetThreatOverride(float CurrentThreat)//offset:0xF131B0;
	float GetInitialThreat()//offset:0xF130E0;
};


// Class DreadHunger.DH_AIAttack
// size:0x0040 (0x0028 - 0x0068)
class UDH_AIAttack : public UObject
{
public:
	class UDamageType*                                 DamageType;                                               // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Damage;                                                   // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ActivationRange;                                          // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ActivationDelay;                                          // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBlocksMovement;                                          // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	int                                                AllowedMovementModes;                                     // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Impulse;                                                  // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAttackImpulseDirection                            ImpulseDirection;                                         // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	class UAnimSequenceBase*                           Animation;                                                // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAttackAnimationSlot                               AnimationSlot;                                            // 0x0058(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0059(0x0007) MISSED OFFSET
	class USoundBase*                                  Sound;                                                    // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};


// Class DreadHunger.DH_AIAttack_Melee
// size:0x0000 (0x0068 - 0x0068)
class UDH_AIAttack_Melee : public UDH_AIAttack
{
public:
};


// Class DreadHunger.DH_AIAttack_AOE
// size:0x0020 (0x0068 - 0x0088)
class UDH_AIAttack_AOE : public UDH_AIAttack
{
public:
	float                                              InnerRadius;                                              // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              OuterRadius;                                              // 0x006C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageFalloff;                                            // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageThroughBlockScale;                                  // 0x0074(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              OuterRadiusThroughBlockScale;                             // 0x0078(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       CollisionProfile;                                         // 0x007C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
};


// Class DreadHunger.DH_AIAttack_Projectile
// size:0x0008 (0x0068 - 0x0070)
class UDH_AIAttack_Projectile : public UDH_AIAttack
{
public:
	class ADH_Projectile*                              Projectile;                                               // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};


// Class DreadHunger.DH_AmbientSound
// size:0x0008 (0x0228 - 0x0230)
class ADH_AmbientSound : public AAmbientSound
{
public:
	class UCurveFloat*                                 TODVolumeCurve;                                           // 0x0228(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};


// Class DreadHunger.DH_Character
// size:0x04A0 (0x04C0 - 0x0960)
class ADH_Character : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x04C0(0x0018) MISSED OFFSET
	class ADH_Character*                               DefaultCharacter;                                         // 0x04D8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UDH_ColorMaskComponent*                      ColorMaskComponent;                                       // 0x04E0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UDH_ImpactEffect*                            FootstepEffects;                                          // 0x04E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_ImpactEffect*                            LandingEffects;                                           // 0x04F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FName>                               ArmBoneNames;                                             // 0x04F8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               LegBoneNames;                                             // 0x0508(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               FootBoneNames;                                            // 0x0518(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FName                                       SnareSocket;                                              // 0x0528(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<class UDamageType*, class USoundBase*>        PainSounds;                                               // 0x0530(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class USoundBase*                                  DeathSound;                                               // 0x0580(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  HallucinationDissipateSound;                              // 0x0588(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeathUnpossessDelay;                                      // 0x0590(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPhysicalHitReactionBlendWeight;                        // 0x0594(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UStaticMesh*                                 CarcassStaticMesh;                                        // 0x0598(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCorpseReceivesDecals;                                    // 0x05A0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x05A1(0x0007) MISSED OFFSET
	class UStaticMeshComponent*                        CarcassMesh;                                              // 0x05A8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FName                                       HeadBoneName;                                             // 0x05B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct UEMulticastInlineDelegate                   OnDiedDelegate;                                           // 0x05B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	EPlayerMatchStatType                               DeathStat;                                                // 0x05C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x05C9(0x0003) MISSED OFFSET
	float                                              DeathTime;                                                // 0x05CC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LastReceivedDamageTime;                                   // 0x05D0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FallingDamageThreshold;                                   // 0x05D4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TMap<class UDH_DamageType*, float>                 DamageResistances;                                        // 0x05D8(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UAIPerceptionStimuliSourceComponent*         PerceptionStimuli;                                        // 0x0628(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	EInventoryTransactionRules                         DeathInventoryTransactionRules;                           // 0x0630(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0631(0x0003) MISSED OFFSET
	float                                              DeathInventorySpawnPct;                                   // 0x0634(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0638(0x0008) MISSED OFFSET
	class ADH_ClimbableActor*                          CurrentClimbingActor;                                     // 0x0640(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	class UDH_ImpactEffect*                            ObliterationEffect;                                       // 0x0648(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowDismemberment;                                      // 0x0650(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0651(0x0003) MISSED OFFSET
	int                                                MaxAllowedWounds;                                         // 0x0654(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class ADH_BodyPartPickup*>                  BodyParts;                                                // 0x0658(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TMap<struct FName, struct FVector>                 BodyPartBonePositions;                                    // 0x0668(0x0050)
	struct UEMulticastInlineDelegate                   OnReservedHealthChangedDelegate;                          // 0x06B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnMaximumHealthChangedDelegate;                           // 0x06C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnDeathStateChanged;                                      // 0x06D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              AttackCooldown;                                           // 0x06E8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x06EC(0x0004) MISSED OFFSET
	float                                              IdleSpeed;                                                // 0x06F0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RunSpeed;                                                 // 0x06F4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_Character*                               TargetCharacter;                                          // 0x06F8(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x0700(0x0004) MISSED OFFSET
	struct FHitResult                                  LastLanding;                                              // 0x0704(0x008C) (Net, IsPlainOldData)
	class AController*                                 LastDamageInstigator;                                     // 0x0790(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AActor*                                      LastDamageCauser;                                         // 0x0798(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSnareFlash                                 Snare;                                                    // 0x07A0(0x0010) (Net)
	struct FDamageInstance                             LastDamageReceived;                                       // 0x07B0(0x0030) (Net)
	float                                              MaximumHealth;                                            // 0x07E0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x07E4(0x0004) MISSED OFFSET
	TArray<class UMaterialInstanceDynamic*>            MeshMIDs;                                                 // 0x07E8(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData09[0x10];                                      // 0x07F8(0x0010) MISSED OFFSET
	class UDH_InventoryManager*                        InventoryComponent;                                       // 0x0808(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UDH_CraftingComponent*                       CorpseCraftingComponent;                                  // 0x0810(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	ECharacterDeathState                               DeathState;                                               // 0x0818(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x27];                                      // 0x0819(0x0027) MISSED OFFSET
	class ADH_ClimbableActor*                          LastClimbingActor;                                        // 0x0840(0x0008) (ZeroConstructor, IsPlainOldData)
	class UDH_BuoyancyComponent*                       CorpseBuoyancy;                                           // 0x0848(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData11[0xF9];                                      // 0x0850(0x00F9) MISSED OFFSET
	ECharacterHealthState                              CurrentHealthState;                                       // 0x0949(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0x2];                                       // 0x094A(0x0002) MISSED OFFSET
	float                                              CurrentHealth;                                            // 0x094C(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	float                                              CurrentReservedHealth;                                    // 0x0950(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x1];                                       // 0x0954(0x0001) MISSED OFFSET
	struct FGenericTeamId                              TeamID;                                                   // 0x0955(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData14[0xA];                                       // 0x0956(0x000A) MISSED OFFSET

	void TransferInventory_Simulated(class UDH_InventoryManager* SourceInventory, int SourceSlot, class UDH_InventoryManager* TargetInventory, int TargetSlot, int Quantity, bool bAutoFindTargetSlot, bool bQuickLoot)//offset:0xF1BF70;
	void TransferInventory(class UDH_InventoryManager* SourceManager, int SourceSlot, class UDH_InventoryManager* TargetManager, int TargetSlot, int Quantity, bool bAutoFindTargetSlot, bool bQuickLoot)//offset:0xF1BD60;
	void SetShouldRun(bool bNewShouldRun)//offset:0xF1BC00;
	void SetGenericTeamId(const struct FGenericTeamId& NewTeamID)//offset:0xF1BB60;
	void OnRep_TargetCharacter()//offset:0xF1B580;
	void OnRep_Snare()//offset:0xF1B540;
	void OnRep_LastLanding()//offset:0xF1B500;
	void OnRep_LastDamageReceived(const struct FDamageInstance& PreviousDamageInstance)//offset:0xF1B440;
	void OnRep_DeathState()//offset:0xF1B420;
	void OnRep_CurrentReservedHealth()//offset:0xF1B400;
	void OnRep_CurrentHealth()//offset:0xF1B3E0;
	void OnRep_CurrentClimbingActor()//offset:0xF1B3C0;
	void OnInventoryEmptied()//offset:0xF1B2D0;
	void OnHarvestedCorpse()//offset:0xF1B2B0;
	void OnEnsnared(class ADH_BearTrapPickup* InSnare)//offset:0x13CEB30;
	void OnDied()//offset:0x13CEB30;
	void OnCinematicModeChanged(bool bCinematicMode)//offset:0xF1B0C0;
	void ModifyHealth(float Delta)//offset:0xF1AD50;
	bool IsSwimming()//offset:0xF1AD20;
	bool IsEnsnared()//offset:0xF1ACF0;
	bool IsClimbing()//offset:0xF1ACC0;
	bool IsAlive()//offset:0xF1AC90;
	void InventoryTransferSucceeded(class UDH_InventoryManager* SourceInventory, int SourceSlot, class UDH_InventoryManager* TargetInventory, int TargetSlot)//offset:0xF1AB40;
	void InventoryTransferFailed(class UDH_InventoryManager* SourceInventory, int SourceSlot, class UDH_InventoryManager* TargetInventory, int TargetSlot)//offset:0xF1A9F0;
	void InventoryQuickTransferSucceeded(class UDH_InventoryManager* SourceInventory, int SourceSlot, class UDH_InventoryManager* TargetInventory, int TargetSlot)//offset:0xF1A8A0;
	void HallucinationExpired()//offset:0xF1A880;
	float GetSnareDurationModifier()//offset:0xF1A840;
	float GetMaximumHealth()//offset:0xF1A820;
	class UDH_InventoryManager* GetInventoryComponent()//offset:0xF1A800;
	class UDH_InventoryManager* GetInventory()//offset:0xF1A800;
	struct FGenericTeamId GetGenericTeamId()//offset:0xF1A7C0;
	ECharacterDeathState GetDeathState()//offset:0xF1A7A0;
	float GetCurrentReservedHealth()//offset:0xF1A780;
	ECharacterHealthState GetCurrentHealthState()//offset:0xF1A760;
	float GetCurrentHealth()//offset:0xF1A740;
	class UDH_CraftingComponent* GetCorpseCraftingComponent()//offset:0xF1A720;
	class UDH_CharacterAnimInstance* GetCharacterAnimInst()//offset:0xF1A6F0;
	TArray<struct FName> GetBodyPartBoneList()//offset:0xF1A670;
	TEnumAsByte<ETeamAttitude> GetAttitudeTowards(class AActor* Other)//offset:0xF1A5D0;
	void Ensnare(class ADH_BearTrapPickup* InSnare, float InSnareDuration)//offset:0xF1A450;
	void DropInventory_Simulated(int InventoryIndex, bool bThrown, EInventoryDropMethod DropMethod, const struct FVector& OffsetVariation, const struct FRotator& RotationVariation, int DropCount)//offset:0xF1A250;
	void Died(class AController* Killer, class UDamageType* KillingDamageType, float OverkillDamage)//offset:0xF1A140;
	bool CanBeEnsnared()//offset:0xF1A110;
	bool Attack(class AActor* Target, int InAttackIndex)//offset:0xF1A040;
	void AdjustDamage(float* Damage, const struct FDamageEvent& DamageEvent, class AController* DamageInstigator)//offset:0xF19EF0;
	void AddDeathInventory(class ADH_Inventory* Type, int Amount)//offset:0xF19CF0;
};


// Class DreadHunger.DH_AnimalCharacter
// size:0x0150 (0x0960 - 0x0AB0)
class ADH_AnimalCharacter : public ADH_Character
{
public:
	class UAudioComponent*                             AmbientAudioComponent;                                    // 0x0960(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USoundBase*                                  NewTargetSound;                                           // 0x0968(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  LostTargetSound;                                          // 0x0970(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  HowlSound;                                                // 0x0978(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FDHFloatInterval                            HowlRange;                                                // 0x0980(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	int                                                HowlMinGroupSize;                                         // 0x0988(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HowlMinGroupRadius;                                       // 0x098C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FDHFloatInterval                            HowlCooldown;                                             // 0x0990(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                               bAllowAttackDamageScaling;                                // 0x0998(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0999(0x0007) MISSED OFFSET
	TArray<struct FAIAttack>                           AttackTypes;                                              // 0x09A0(0x0010) (Edit, ZeroConstructor)
	float                                              StuckSpeed;                                               // 0x09B0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StuckTime;                                                // 0x09B4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CallForHelpRange;                                         // 0x09B8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CallForHelpTotalTime;                                     // 0x09BC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CallForHelpDelayTime;                                     // 0x09C0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x09C4(0x0004) MISSED OFFSET
	class UAnimMontage*                                CallForHelpMontage;                                       // 0x09C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CallForHelpSound;                                         // 0x09D0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_PlayerState*                             Summoner;                                                 // 0x09D8(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               bCallingForHelp;                                          // 0x09E0(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x09E1(0x0007) MISSED OFFSET
	unsigned char                                      UnknownData03[0x50];                                      // 0x09E1(0x0050) UNKNOWN PROPERTY: 
	class UAudioComponent*                             HowlAudioComponent;                                       // 0x0A38(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FAttackFlash                                AttackFlash;                                              // 0x0A40(0x0008) (Net)
	unsigned char                                      UnknownData04[0x60];                                      // 0x0A48(0x0060) MISSED OFFSET
	float                                              AttackSpeedModifier;                                      // 0x0AA8(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               bCanAttackWhileSwimming;                                  // 0x0AAC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0AAD(0x0003) MISSED OFFSET

	void PlayCallForHelp()//offset:0xF13BE0;
	void OnSpellExpired(class UDH_TotemSpell* Spell, ETotemSpellTiers CastTier)//offset:0xF13970;
	void OnSpellCast(class UDH_TotemSpell* Spell, ETotemSpellTiers CastTier)//offset:0xF137D0;
	void OnRep_AttackFlash()//offset:0xF136E0;
	bool IsAttackingTeammate(class ADH_PlayerState* OtherPlayer)//offset:0xF13280;
	class UPrimitiveComponent* GetPackIceCollider()//offset:0x13CEB30;
};


// Class DreadHunger.DH_Inventory
// size:0x06F0 (0x0220 - 0x0910)
class ADH_Inventory : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0220(0x0008) MISSED OFFSET
	bool                                               bReplicateStateToNonOwningClients;                        // 0x0228(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bOnlyReplicateNonOwningStateOnce;                         // 0x0229(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x022A(0x0006) MISSED OFFSET
	struct FText                                       FriendlyName;                                             // 0x0230(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FText                                       Description;                                              // 0x0248(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FName                                       TutorialConcept;                                          // 0x0260(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_HumanCharacter*                          HumanOwner;                                               // 0x0268(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class ADH_HumanCharacter*                          HumanInstigator;                                          // 0x0270(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class ADH_PlayerState*                             PlayerInstigator;                                         // 0x0278(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDH_InventoryManager*                        InventoryManager;                                         // 0x0280(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDH_CraftingRecipe*                          CraftingRecipe;                                           // 0x0288(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EInventoryType                                     InventoryType;                                            // 0x0290(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAttachToOwner;                                           // 0x0291(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bThrallItem;                                              // 0x0292(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bScoreOnDestroyed;                                        // 0x0293(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0294(0x0004) MISSED OFFSET
	class UTexture2D*                                  Icon;                                                     // 0x0298(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_InventoryView*                           ViewClass;                                                // 0x02A0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ADH_InventoryPickup*                         PickupClass;                                              // 0x02A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct UEMulticastInlineDelegate                   OnInventoryModified;                                      // 0x02B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               bCanBeAimed;                                              // 0x02C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAllowHoldToAim;                                          // 0x02C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bReloadWhenAimed;                                         // 0x02C2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPreventCraftWhileAimed;                                  // 0x02C3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimEntryTime;                                             // 0x02C4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimExitTime;                                              // 0x02C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x02CC(0x0004) MISSED OFFSET
	struct FViewAlignedInventoryEventEffects           AimEntryEffects;                                          // 0x02D0(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FViewAlignedInventoryEventEffects           AimExitEffects;                                           // 0x02F8(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FTransform                                  AimingLeftArmTransform;                                   // 0x0320(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FTransform                                  AimingRightArmTransform;                                  // 0x0350(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	EInventoryAimingStyle                              AimingStyle;                                              // 0x0380(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0381(0x0007) MISSED OFFSET
	class UAnimSequenceBase*                           AimedAnimation;                                           // 0x0388(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           AimedAnimation_FP;                                        // 0x0390(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimingFOVZoom;                                            // 0x0398(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimingFOVInterpSpeed;                                     // 0x039C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShowCrosshair;                                           // 0x03A0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x03A1(0x0003) MISSED OFFSET
	float                                              CrosshairAimingScale;                                     // 0x03A4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          AimingPostProcessMaterial;                                // 0x03A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCanBeReloaded;                                           // 0x03B0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bReloadAfterUse;                                          // 0x03B1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCanAimWhileReloading;                                    // 0x03B2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x03B3(0x0001) MISSED OFFSET
	float                                              ReloadTime;                                               // 0x03B4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FViewAlignedInventoryEventEffects           ReloadEffects;                                            // 0x03B8(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FTransform                                  ReloadingLeftArmTransform;                                // 0x03E0(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FTransform                                  ReloadingRightArmTransform;                               // 0x0410(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bScaleReloadAnimToReloadRate;                             // 0x0440(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasDurability;                                           // 0x0441(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDestroyOnZeroDurability;                                 // 0x0442(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShowDurabilityWhenFull;                                  // 0x0443(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAlwaysDamageWhenDropped;                                 // 0x0444(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDamageWhenUsed;                                          // 0x0445(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x0446(0x0002) MISSED OFFSET
	float                                              DefaultDurability;                                        // 0x0448(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                DurabilityUses;                                           // 0x044C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x0450(0x0004) MISSED OFFSET
	bool                                               bCanBeUsed;                                               // 0x0454(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseOnRelease;                                            // 0x0455(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCanAimWhileUsing;                                        // 0x0456(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPoisonItem;                                              // 0x0457(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUpgradeItem;                                             // 0x0458(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTaintedByDefault;                                        // 0x0459(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x6];                                       // 0x045A(0x0006) MISSED OFFSET
	struct FTransform                                  UsingLeftArmTransform;                                    // 0x0460(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FTransform                                  UsingRightArmTransform;                                   // 0x0490(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bScaleUseAnimToCooldownRate;                              // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x7];                                       // 0x04C1(0x0007) MISSED OFFSET
