                                                      /* 该SDK由虚幻引擎工具生成,该工具完全免费! */

                                                      /* 作者:BiliBili:窗边的短脚猫 */

                                                      /* Link:https://space.bilibili.com/3671718 */

#pragma once

// DreadHunger-Win64-Shipping SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DreadHunger-Win64-Shipping_AIModule_structs.hpp"

//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class AIModule.AIController
// size:0x0090 (0x0298 - 0x0328)
class AAIController : public AController
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0298(0x0038) MISSED OFFSET
	unsigned char                                      bStartAILogicOnPossess;                                   // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bStopAILogicOnUnposses;                                   // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bLOSflag;                                                 // 0x02D0(0x0001)
	unsigned char                                      bSkipExtraLOSChecks;                                      // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bAllowStrafe;                                             // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bWantsPlayerState;                                        // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bSetControlRotationFromPawnOrientation;                   // 0x02D0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x7];                                       // 0x02D1(0x0007) MISSED OFFSET
	class UPathFollowingComponent*                     PathFollowingComponent;                                   // 0x02D8(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	class UBrainComponent*                             BrainComponent;                                           // 0x02E0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAIPerceptionComponent*                      PerceptionComponent;                                      // 0x02E8(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	class UPawnActionsComponent*                       ActionsComp;                                              // 0x02F0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlackboardComponent*                        Blackboard;                                               // 0x02F8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UGameplayTasksComponent*                     CachedGameplayTasksComponent;                             // 0x0300(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UNavigationQueryFilter*                      DefaultNavigationFilterClass;                             // 0x0308(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct UEMulticastInlineDelegate                   ReceiveMoveCompleted;                                     // 0x0310(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0320(0x0008) MISSED OFFSET

	bool UseBlackboard(class UBlackboardData* BlackboardAsset, class UBlackboardComponent** BlackboardComponent)//offset:0x3113FE0;
	void UnclaimTaskResource(class UGameplayTaskResource* ResourceClass)//offset:0x3113D90;
	void SetPathFollowingComponent(class UPathFollowingComponent* NewPFComponent)//offset:0x3113880;
	void SetMoveBlockDetection(bool bEnable)//offset:0x31137F0;
	bool RunBehaviorTree(class UBehaviorTree* BTAsset)//offset:0x3113600;
	void OnUsingBlackBoard(class UBlackboardComponent* BlackboardComp, class UBlackboardData* BlackboardAsset)//offset:0x13CEB30;
	void OnGameplayTaskResourcesClaimed(const struct FGameplayResourceSet& NewlyClaimed, const struct FGameplayResourceSet& FreshlyReleased)//offset:0x31132C0;
	TEnumAsByte<EPathFollowingRequestResult> MoveToLocation(const struct FVector& Dest, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, class UNavigationQueryFilter* FilterClass, bool bAllowPartialPath)//offset:0x3113030;
	TEnumAsByte<EPathFollowingRequestResult> MoveToActor(class AActor* Goal, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bCanStrafe, class UNavigationQueryFilter* FilterClass, bool bAllowPartialPath)//offset:0x3112DF0;
	void K2_SetFocus(class AActor* NewFocus)//offset:0x3112C50;
	void K2_SetFocalPoint(const struct FVector& FP)//offset:0x3112BC0;
	void K2_ClearFocus()//offset:0x3112BA0;
	bool HasPartialPath()//offset:0x31129C0;
	class UPathFollowingComponent* GetPathFollowingComponent()//offset:0x1043290;
	TEnumAsByte<EPathFollowingStatus> GetMoveStatus()//offset:0x3112670;
	struct FVector GetImmediateMoveDestination()//offset:0x3112540;
	class AActor* GetFocusActor()//offset:0x3112510;
	struct FVector GetFocalPointOnActor(class AActor* Actor)//offset:0x3112460;
	struct FVector GetFocalPoint()//offset:0x3112420;
	class UAIPerceptionComponent* GetAIPerceptionComponent()//offset:0x3111F80;
	void ClaimTaskResource(class UGameplayTaskResource* ResourceClass)//offset:0x3111C60;
};


// Class AIModule.AIAsyncTaskBlueprintProxy
// size:0x0040 (0x0028 - 0x0068)
class UAIAsyncTaskBlueprintProxy : public UObject
{
public:
	struct UEMulticastInlineDelegate                   OnSuccess;                                                // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnFail;                                                   // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0048(0x0020) MISSED OFFSET

	void OnMoveCompleted(const struct FAIRequestID& RequestID, TEnumAsByte<EPathFollowingResult> MovementResult)//offset:0x3113390;
};


// Class AIModule.AIBlueprintHelperLibrary
// size:0x0000 (0x0028 - 0x0028)
class UAIBlueprintHelperLibrary : public UBlueprintFunctionLibrary
{
public:

	static void UnlockAIResourcesWithAnimation(class UAnimInstance* AnimInstance, bool bUnlockMovement, bool UnlockAILogic)//offset:0x3113E20;
	static class APawn* SpawnAIFromClass(class UObject* WorldContextObject, class APawn* PawnClass, class UBehaviorTree* BehaviorTree, const struct FVector& Location, const struct FRotator& Rotation, bool bNoCollisionFail, class AActor* Owner)//offset:0x3113B60;
	static void SimpleMoveToLocation(class AController* Controller, const struct FVector& Goal)//offset:0x3113AA0;
	static void SimpleMoveToActor(class AController* Controller, class AActor* Goal)//offset:0x31139E0;
	static void SendAIMessage(class APawn* Target, const struct FName& Message, class UObject* MessageSource, bool bSuccess)//offset:0x31136A0;
	static void LockAIResourcesWithAnimation(class UAnimInstance* AnimInstance, bool bLockMovement, bool LockAILogic)//offset:0x3112CE0;
	static bool IsValidAIRotation(const struct FRotator& Rotation)//offset:0x3112B10;
	static bool IsValidAILocation(const struct FVector& Location)//offset:0x3112A80;
	static bool IsValidAIDirection(const struct FVector& DirectionVector)//offset:0x31129F0;
	static int GetNextNavLinkIndex(class AController* Controller)//offset:0x31126A0;
	static TArray<struct FVector> GetCurrentPathPoints(class AController* Controller)//offset:0x3112250;
	static int GetCurrentPathIndex(class AController* Controller)//offset:0x31121C0;
	static class UNavigationPath* GetCurrentPath(class AController* Controller)//offset:0x3112130;
	static class UBlackboardComponent* GetBlackboard(class AActor* Target)//offset:0x31120A0;
	static class AAIController* GetAIController(class AActor* ControlledActor)//offset:0x3111EF0;
	static class UAIAsyncTaskBlueprintProxy* CreateMoveToProxyObject(class UObject* WorldContextObject, class APawn* Pawn, const struct FVector& Destination, class AActor* TargetActor, float AcceptanceRadius, bool bStopOnOverlap)//offset:0x3111CF0;
};


// Class AIModule.AIDataProvider
// size:0x0000 (0x0028 - 0x0028)
class UAIDataProvider : public UObject
{
public:
};


// Class AIModule.AIDataProvider_QueryParams
// size:0x0018 (0x0028 - 0x0040)
class UAIDataProvider_QueryParams : public UAIDataProvider
{
public:
	struct FName                                       ParamName;                                                // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FloatValue;                                               // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                IntValue;                                                 // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               BoolValue;                                                // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
};


// Class AIModule.AIDataProvider_Random
// size:0x0010 (0x0040 - 0x0050)
class UAIDataProvider_Random : public UAIDataProvider_QueryParams
{
public:
	float                                              Min;                                                      // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Max;                                                      // 0x0044(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bInteger;                                                 // 0x0048(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
};


// Class AIModule.AIHotSpotManager
// size:0x0000 (0x0028 - 0x0028)
class UAIHotSpotManager : public UObject
{
public:
};


// Class AIModule.AIPerceptionComponent
// size:0x00E0 (0x00B0 - 0x0190)
class UAIPerceptionComponent : public UActorComponent
{
public:
	TArray<class UAISenseConfig*>                      SensesConfig;                                             // 0x00B0(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance)
	class UAISense*                                    DominantSense;                                            // 0x00C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x00C8(0x0010) MISSED OFFSET
	class AAIController*                               AIOwner;                                                  // 0x00D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x80];                                      // 0x00E0(0x0080) MISSED OFFSET
	struct UEMulticastInlineDelegate                   OnPerceptionUpdated;                                      // 0x0160(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnTargetPerceptionUpdated;                                // 0x0170(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnTargetPerceptionInfoUpdated;                            // 0x0180(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	void SetSenseEnabled(class UAISense* SenseClass, bool bEnable)//offset:0x3113910;
	void RequestStimuliListenerUpdate()//offset:0x31135E0;
	void OnOwnerEndPlay(class AActor* Actor, TEnumAsByte<EEndPlayReason> EndPlayReason)//offset:0x3113460;
	void GetPerceivedHostileActorsBySense(class UAISense* SenseToUse, TArray<class AActor*>* OutActors)//offset:0x31128D0;
	void GetPerceivedHostileActors(TArray<class AActor*>* OutActors)//offset:0x3112820;
	void GetPerceivedActors(class UAISense* SenseToUse, TArray<class AActor*>* OutActors)//offset:0x3112730;
	void GetKnownPerceivedActors(class UAISense* SenseToUse, TArray<class AActor*>* OutActors)//offset:0x3112580;
	void GetCurrentlyPerceivedActors(class UAISense* SenseToUse, TArray<class AActor*>* OutActors)//offset:0x3112330;
	bool GetActorsPerception(class AActor* Actor, struct FActorPerceptionBlueprintInfo* Info)//offset:0x3111FA0;
	void ForgetAll()//offset:0x3111ED0;
};


// Class AIModule.AIPerceptionListenerInterface
// size:0x0000 (0x0028 - 0x0028)
class UAIPerceptionListenerInterface : public UInterface
{
public:
};


// Class AIModule.AIPerceptionStimuliSourceComponent
// size:0x0018 (0x00B0 - 0x00C8)
class UAIPerceptionStimuliSourceComponent : public UActorComponent
{
public:
	unsigned char                                      bAutoRegisterAsSource;                                    // 0x00B0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Config)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00B1(0x0007) MISSED OFFSET
	TArray<class UAISense*>                            RegisterAsSourceForSenses;                                // 0x00B8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)

	void UnregisterFromSense(class UAISense* SenseClass)//offset:0x3113F50;
	void UnregisterFromPerceptionSystem()//offset:0x3113F30;
	void RegisterWithPerceptionSystem()//offset:0x31135C0;
	void RegisterForSense(class UAISense* SenseClass)//offset:0x3113530;
};


// Class AIModule.AISubsystem
// size:0x0010 (0x0028 - 0x0038)
class UAISubsystem : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UAISystem*                                   AISystem;                                                 // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
};


// Class AIModule.AIPerceptionSystem
// size:0x00F8 (0x0038 - 0x0130)
class UAIPerceptionSystem : public UAISubsystem
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) MISSED OFFSET
	TArray<class UAISense*>                            Senses;                                                   // 0x0088(0x0010) (ZeroConstructor)
	float                                              PerceptionAgingRate;                                      // 0x0098(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x94];                                      // 0x009C(0x0094) MISSED OFFSET

	static void ReportPerceptionEvent(class UObject* WorldContextObject, class UAISenseEvent* PerceptionEvent)//offset:0x3118820;
	void ReportEvent(class UAISenseEvent* PerceptionEvent)//offset:0x31185B0;
	static bool RegisterPerceptionStimuliSource(class UObject* WorldContextObject, class UAISense* Sense, class AActor* Target)//offset:0x31182C0;
	void OnPerceptionStimuliSourceEndPlay(class AActor* Actor, TEnumAsByte<EEndPlayReason> EndPlayReason)//offset:0x31181F0;
	static class UAISense* GetSenseClassForStimulus(class UObject* WorldContextObject, const struct FAIStimulus& Stimulus)//offset:0x31180B0;
};


// Class AIModule.AIResourceInterface
// size:0x0000 (0x0028 - 0x0028)
class UAIResourceInterface : public UInterface
{
public:
};


// Class AIModule.AIResource_Movement
// size:0x0000 (0x0038 - 0x0038)
class UAIResource_Movement : public UGameplayTaskResource
{
public:
};


// Class AIModule.AIResource_Logic
// size:0x0000 (0x0038 - 0x0038)
class UAIResource_Logic : public UGameplayTaskResource
{
public:
};


// Class AIModule.AISense
// size:0x0058 (0x0028 - 0x0080)
class UAISense : public UObject
{
public:
	float                                              DefaultExpirationAge;                                     // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, EditConst, IsPlainOldData)
	EAISenseNotifyType                                 NotifyType;                                               // 0x002C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	unsigned char                                      bWantsNewPawnNotification;                                // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance)
	unsigned char                                      bAutoRegisterAllPawnsAsSources;                           // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	class UAIPerceptionSystem*                         PerceptionSystemInstance;                                 // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x40];                                      // 0x0040(0x0040) MISSED OFFSET
};


// Class AIModule.AISense_Blueprint
// size:0x0028 (0x0080 - 0x00A8)
class UAISense_Blueprint : public UAISense
{
public:
	class UUserDefinedStruct*                          ListenerDataType;                                         // 0x0080(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAIPerceptionComponent*>              ListenerContainer;                                        // 0x0088(0x0010) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor)
	TArray<class UAISenseEvent*>                       UnprocessedEvents;                                        // 0x0098(0x0010) (ZeroConstructor)

	float OnUpdate(TArray<class UAISenseEvent*> EventsToProcess)//offset:0x13CEB30;
	void OnListenerUpdated(class AActor* ActorListener, class UAIPerceptionComponent* PerceptionComponent)//offset:0x13CEB30;
	void OnListenerUnregistered(class AActor* ActorListener, class UAIPerceptionComponent* PerceptionComponent)//offset:0x13CEB30;
	void OnListenerRegistered(class AActor* ActorListener, class UAIPerceptionComponent* PerceptionComponent)//offset:0x13CEB30;
	void K2_OnNewPawn(class APawn* NewPawn)//offset:0x13CEB30;
	void GetAllListenerComponents(TArray<class UAIPerceptionComponent*>* ListenerComponents)//offset:0x3118000;
	void GetAllListenerActors(TArray<class AActor*>* ListenerActors)//offset:0x3117F50;
};


// Class AIModule.AISense_Damage
// size:0x0010 (0x0080 - 0x0090)
class UAISense_Damage : public UAISense
{
public:
	TArray<struct FAIDamageEvent>                      RegisteredEvents;                                         // 0x0080(0x0010) (ZeroConstructor)

	static void ReportDamageEvent(class UObject* WorldContextObject, class AActor* DamagedActor, class AActor* Instigator, float DamageAmount, const struct FVector& EventLocation, const struct FVector& HitLocation)//offset:0x31183C0;
};


// Class AIModule.AISense_Hearing
// size:0x0068 (0x0080 - 0x00E8)
class UAISense_Hearing : public UAISense
{
public:
	TArray<struct FAINoiseEvent>                       NoiseEvents;                                              // 0x0080(0x0010) (ZeroConstructor)
	float                                              SpeedOfSoundSq;                                           // 0x0090(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x54];                                      // 0x0094(0x0054) MISSED OFFSET

	static void ReportNoiseEvent(class UObject* WorldContextObject, const struct FVector& NoiseLocation, float Loudness, class AActor* Instigator, float MaxRange, const struct FName& Tag)//offset:0x3118640;
};


// Class AIModule.AISense_Prediction
// size:0x0010 (0x0080 - 0x0090)
class UAISense_Prediction : public UAISense
{
public:
	TArray<struct FAIPredictionEvent>                  RegisteredEvents;                                         // 0x0080(0x0010) (ZeroConstructor)

	static void RequestPawnPredictionEvent(class APawn* Requestor, class AActor* PredictedActor, float PredictionTime)//offset:0x31189F0;
	static void RequestControllerPredictionEvent(class AAIController* Requestor, class AActor* PredictedActor, float PredictionTime)//offset:0x31188E0;
};


// Class AIModule.AISense_Sight
// size:0x00F0 (0x0080 - 0x0170)
class UAISense_Sight : public UAISense
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0080(0x00C8) MISSED OFFSET
	int                                                MaxTracesPerTick;                                         // 0x0148(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	int                                                MinQueriesPerTimeSliceCheck;                              // 0x014C(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	double                                             MaxTimeSlicePerTick;                                      // 0x0150(0x0008) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              HighImportanceQueryDistanceThreshold;                     // 0x0158(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x015C(0x0004) MISSED OFFSET
	float                                              MaxQueryImportance;                                       // 0x0160(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              SightLimitQueryImportance;                                // 0x0164(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0168(0x0008) MISSED OFFSET
};


// Class AIModule.AISense_Team
// size:0x0010 (0x0080 - 0x0090)
class UAISense_Team : public UAISense
{
public:
	TArray<struct FAITeamStimulusEvent>                RegisteredEvents;                                         // 0x0080(0x0010) (ZeroConstructor)
};


// Class AIModule.AISense_Touch
// size:0x0010 (0x0080 - 0x0090)
class UAISense_Touch : public UAISense
{
public:
	TArray<struct FAITouchEvent>                       RegisteredEvents;                                         // 0x0080(0x0010) (ZeroConstructor)
};


// Class AIModule.AISenseBlueprintListener
// size:0x0000 (0x0108 - 0x0108)
class UAISenseBlueprintListener : public UUserDefinedStruct
{
public:
};


// Class AIModule.AISenseConfig
// size:0x0020 (0x0028 - 0x0048)
class UAISenseConfig : public UObject
{
public:
	struct FColor                                      DebugColor;                                               // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxAge;                                                   // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bStartsEnabled;                                           // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0031(0x0017) MISSED OFFSET
};


// Class AIModule.AISenseConfig_Blueprint
// size:0x0008 (0x0048 - 0x0050)
class UAISenseConfig_Blueprint : public UAISenseConfig
{
public:
	class UAISense_Blueprint*                          Implementation;                                           // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData)
};


// Class AIModule.AISenseConfig_Damage
// size:0x0008 (0x0048 - 0x0050)
class UAISenseConfig_Damage : public UAISenseConfig
{
public:
	class UAISense_Damage*                             Implementation;                                           // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData)
};


// Class AIModule.AISenseConfig_Hearing
// size:0x0018 (0x0048 - 0x0060)
class UAISenseConfig_Hearing : public UAISenseConfig
{
public:
	class UAISense_Hearing*                            Implementation;                                           // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData)
	float                                              HearingRange;                                             // 0x0050(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LoSHearingRange;                                          // 0x0054(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bUseLoSHearing;                                           // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0059(0x0003) MISSED OFFSET
	struct FAISenseAffiliationFilter                   DetectionByAffiliation;                                   // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
};


// Class AIModule.AISenseConfig_Prediction
// size:0x0000 (0x0048 - 0x0048)
class UAISenseConfig_Prediction : public UAISenseConfig
{
public:
};


// Class AIModule.AISenseConfig_Sight
// size:0x0028 (0x0048 - 0x0070)
class UAISenseConfig_Sight : public UAISenseConfig
{
public:
	class UAISense_Sight*                              Implementation;                                           // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData)
	float                                              SightRadius;                                              // 0x0050(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              LoseSightRadius;                                          // 0x0054(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              PeripheralVisionAngleDegrees;                             // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	struct FAISenseAffiliationFilter                   DetectionByAffiliation;                                   // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              AutoSuccessRangeFromLastSeenLocation;                     // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              PointOfViewBackwardOffset;                                // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              NearClippingRadius;                                       // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              OmniRadius;                                               // 0x006C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
};


// Class AIModule.AISenseConfig_Team
// size:0x0000 (0x0048 - 0x0048)
class UAISenseConfig_Team : public UAISenseConfig
{
public:
};


// Class AIModule.AISenseConfig_Touch
// size:0x0000 (0x0048 - 0x0048)
class UAISenseConfig_Touch : public UAISenseConfig
{
public:
};


// Class AIModule.AISenseEvent
// size:0x0000 (0x0028 - 0x0028)
class UAISenseEvent : public UObject
{
public:
};


// Class AIModule.AISenseEvent_Damage
// size:0x0030 (0x0028 - 0x0058)
class UAISenseEvent_Damage : public UAISenseEvent
{
public:
	struct FAIDamageEvent                              Event;                                                    // 0x0028(0x0030) (Edit, BlueprintVisible)
};


// Class AIModule.AISenseEvent_Hearing
// size:0x0030 (0x0028 - 0x0058)
class UAISenseEvent_Hearing : public UAISenseEvent
{
public:
	struct FAINoiseEvent                               Event;                                                    // 0x0028(0x0030) (Edit, BlueprintVisible)
};


// Class AIModule.AISightTargetInterface
// size:0x0000 (0x0028 - 0x0028)
class UAISightTargetInterface : public UInterface
{
public:
};


// Class AIModule.AISystem
// size:0x00D8 (0x0058 - 0x0130)
class UAISystem : public UAISystemBase
{
public:
	struct FSoftClassPath                              PerceptionSystemClassName;                                // 0x0058(0x0018) (Edit, ZeroConstructor, Config, GlobalConfig)
	struct FSoftClassPath                              HotSpotManagerClassName;                                  // 0x0070(0x0018) (Edit, ZeroConstructor, Config, GlobalConfig)
	float                                              AcceptanceRadius;                                         // 0x0088(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	float                                              PathfollowingRegularPathPointAcceptanceRadius;            // 0x008C(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	float                                              PathfollowingNavLinkAcceptanceRadius;                     // 0x0090(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bFinishMoveOnGoalOverlap;                                 // 0x0094(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bAcceptPartialPaths;                                      // 0x0095(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bAllowStrafing;                                           // 0x0096(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bEnableBTAITasks;                                         // 0x0097(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bAllowControllersAsEQSQuerier;                            // 0x0098(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bEnableDebuggerPlugin;                                    // 0x0099(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bForgetStaleActors;                                       // 0x009A(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bAddBlackboardSelfKey;                                    // 0x009B(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     DefaultSightCollisionChannel;                             // 0x009C(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	class UBehaviorTreeManager*                        BehaviorTreeManager;                                      // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UEnvQueryManager*                            EnvironmentQueryManager;                                  // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UAIPerceptionSystem*                         PerceptionSystem;                                         // 0x00B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class UAIAsyncTaskBlueprintProxy*>          AllProxyObjects;                                          // 0x00B8(0x0010) (ZeroConstructor, Transient)
	class UAIHotSpotManager*                           HotSpotManager;                                           // 0x00C8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UNavLocalGridManager*                        NavLocalGrids;                                            // 0x00D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x58];                                      // 0x00D8(0x0058) MISSED OFFSET

	void AILoggingVerbose()//offset:0xF54690;
	void AIIgnorePlayers()//offset:0x25CEB10;
};


// Class AIModule.AITask
// size:0x0008 (0x0068 - 0x0070)
class UAITask : public UGameplayTask
{
public:
	class AAIController*                               OwnerController;                                          // 0x0068(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};


// Class AIModule.AITask_LockLogic
// size:0x0000 (0x0070 - 0x0070)
class UAITask_LockLogic : public UAITask
{
public:
};


// Class AIModule.AITask_MoveTo
// size:0x00A0 (0x0070 - 0x0110)
class UAITask_MoveTo : public UAITask
{
public:
	struct UEMulticastInlineDelegate                   OnRequestFailed;                                          // 0x0070(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct UEMulticastInlineDelegate                   OnMoveFinished;                                           // 0x0080(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FAIMoveRequest                              MoveRequest;                                              // 0x0090(0x0040)
	unsigned char                                      UnknownData00[0x40];                                      // 0x00D0(0x0040) MISSED OFFSET

	static class UAITask_MoveTo* AIMoveTo(class AAIController* Controller, const struct FVector& GoalLocation, class AActor* GoalActor, float AcceptanceRadius, TEnumAsByte<EAIOptionFlag> StopOnOverlap, TEnumAsByte<EAIOptionFlag> AcceptPartialPath, bool bUsePathfinding, bool bLockAILogic, bool bUseContinuosGoalTracking, TEnumAsByte<EAIOptionFlag> ProjectGoalOnNavigation)//offset:0x3117C50;
};


// Class AIModule.AITask_RunEQS
// size:0x0078 (0x0070 - 0x00E8)
class UAITask_RunEQS : public UAITask
{
public:

	static class UAITask_RunEQS* RunEQS(class AAIController* Controller, class UEnvQuery* QueryTemplate)//offset:0x3118B00;
};


// Class AIModule.BehaviorTree
// size:0x0040 (0x0028 - 0x0068)
class UBehaviorTree : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UBTCompositeNode*                            RootNode;                                                 // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlackboardData*                             BlackboardAsset;                                          // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<class UBTDecorator*>                        RootDecorators;                                           // 0x0040(0x0010) (ZeroConstructor)
	TArray<struct FBTDecoratorLogic>                   RootDecoratorOps;                                         // 0x0050(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0060(0x0008) MISSED OFFSET
};


// Class AIModule.BrainComponent
// size:0x0058 (0x00B0 - 0x0108)
class UBrainComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00B0(0x0008) MISSED OFFSET
	class UBlackboardComponent*                        BlackboardComp;                                           // 0x00B8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class AAIController*                               AIOwner;                                                  // 0x00C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x40];                                      // 0x00C8(0x0040) MISSED OFFSET

	void StopLogic(const class FString& Reason)//offset:0x311D9F0;
	void StartLogic()//offset:0xF4EE00;
	void RestartLogic()//offset:0xF38D40;
	bool IsRunning()//offset:0x311CF50;
	bool IsPaused()//offset:0x311CF20;
};


// Class AIModule.BehaviorTreeComponent
// size:0x0190 (0x0108 - 0x0298)
class UBehaviorTreeComponent : public UBrainComponent
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0108(0x0020) MISSED OFFSET
	TArray<class UBTNode*>                             NodeInstances;                                            // 0x0128(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0x140];                                     // 0x0138(0x0140) MISSED OFFSET
	class UBehaviorTree*                               DefaultBehaviorTreeAsset;                                 // 0x0278(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0280(0x0018) MISSED OFFSET

	void SetDynamicSubtree(const struct FGameplayTag& InjectTag, class UBehaviorTree* BehaviorAsset)//offset:0x311D020;
	float GetTagCooldownEndTime(const struct FGameplayTag& CooldownTag)//offset:0x311C780;
	void AddCooldownTagDuration(const struct FGameplayTag& CooldownTag, float CooldownDuration, bool bAddToExistingDuration)//offset:0x311C3C0;
};


// Class AIModule.BehaviorTreeManager
// size:0x0028 (0x0028 - 0x0050)
class UBehaviorTreeManager : public UObject
{
public:
	int                                                MaxDebuggerSteps;                                         // 0x0028(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	TArray<struct FBehaviorTreeTemplateInfo>           LoadedTemplates;                                          // 0x0030(0x0010) (ZeroConstructor)
	TArray<class UBehaviorTreeComponent*>              ActiveComponents;                                         // 0x0040(0x0010) (ExportObject, ZeroConstructor)
};


// Class AIModule.BehaviorTreeTypes
// size:0x0000 (0x0028 - 0x0028)
class UBehaviorTreeTypes : public UObject
{
public:
};


// Class AIModule.BlackboardAssetProvider
// size:0x0000 (0x0028 - 0x0028)
class UBlackboardAssetProvider : public UInterface
{
public:

	class UBlackboardData* GetBlackboardAsset()//offset:0x311C570;
};


// Class AIModule.BlackboardComponent
// size:0x0108 (0x00B0 - 0x01B8)
class UBlackboardComponent : public UActorComponent
{
public:
	class UBrainComponent*                             BrainComp;                                                // 0x00B0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UBlackboardData*                             DefaultBlackboardAsset;                                   // 0x00B8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlackboardData*                             BlackboardAsset;                                          // 0x00C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x00C8(0x0020) MISSED OFFSET
	TArray<class UBlackboardKeyType*>                  KeyInstances;                                             // 0x00E8(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0xC0];                                      // 0x00F8(0x00C0) MISSED OFFSET

	void SetValueAsVector(const struct FName& KeyName, const struct FVector& VectorValue)//offset:0x311D900;
	void SetValueAsString(const struct FName& KeyName, const class FString& StringValue)//offset:0x311D7C0;
	void SetValueAsRotator(const struct FName& KeyName, const struct FRotator& VectorValue)//offset:0x311D6D0;
	void SetValueAsObject(const struct FName& KeyName, class UObject* ObjectValue)//offset:0x311D600;
	void SetValueAsName(const struct FName& KeyName, const struct FName& NameValue)//offset:0x311D530;
	void SetValueAsInt(const struct FName& KeyName, int IntValue)//offset:0x311D460;
	void SetValueAsFloat(const struct FName& KeyName, float FloatValue)//offset:0x311D380;
	void SetValueAsEnum(const struct FName& KeyName, unsigned char EnumValue)//offset:0x311D2A0;
	void SetValueAsClass(const struct FName& KeyName, class UObject* ClassValue)//offset:0x311D1D0;
	void SetValueAsBool(const struct FName& KeyName, bool BoolValue)//offset:0x311D0F0;
	bool IsVectorValueSet(const struct FName& KeyName)//offset:0x311CF80;
	struct FVector GetValueAsVector(const struct FName& KeyName)//offset:0x311CE10;
	class FString GetValueAsString(const struct FName& KeyName)//offset:0x311CD30;
	struct FRotator GetValueAsRotator(const struct FName& KeyName)//offset:0x311CC80;
	class UObject* GetValueAsObject(const struct FName& KeyName)//offset:0x311CBE0;
	struct FName GetValueAsName(const struct FName& KeyName)//offset:0x311CB40;
	int GetValueAsInt(const struct FName& KeyName)//offset:0x311CAA0;
	float GetValueAsFloat(const struct FName& KeyName)//offset:0x311CA00;
	unsigned char GetValueAsEnum(const struct FName& KeyName)//offset:0x311C960;
	class UObject* GetValueAsClass(const struct FName& KeyName)//offset:0x311C8C0;
	bool GetValueAsBool(const struct FName& KeyName)//offset:0x311C820;
	bool GetRotationFromEntry(const struct FName& KeyName, struct FRotator* ResultRotation)//offset:0x311C690;
	bool GetLocationFromEntry(const struct FName& KeyName, struct FVector* ResultLocation)//offset:0x311C5A0;
	void ClearValue(const struct FName& KeyName)//offset:0x311C4E0;
};


// Class AIModule.BlackboardData
// size:0x0020 (0x0030 - 0x0050)
class UBlackboardData : public UDataAsset
{
public:
	class UBlackboardData*                             Parent;                                                   // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FBlackboardEntry>                    Keys;                                                     // 0x0038(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      bHasSynchronizedKeys;                                     // 0x0048(0x0001)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
};


// Class AIModule.BlackboardKeyType
// size:0x0008 (0x0028 - 0x0030)
class UBlackboardKeyType : public UObject
{
public:
};


// Class AIModule.BlackboardKeyType_Bool
// size:0x0000 (0x0030 - 0x0030)
class UBlackboardKeyType_Bool : public UBlackboardKeyType
{
public:
};


// Class AIModule.BlackboardKeyType_Class
// size:0x0008 (0x0030 - 0x0038)
class UBlackboardKeyType_Class : public UBlackboardKeyType
{
public:
	class UObject*                                     BaseClass;                                                // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};


// Class AIModule.BlackboardKeyType_Enum
// size:0x0020 (0x0030 - 0x0050)
class UBlackboardKeyType_Enum : public UBlackboardKeyType
{
public:
	class UEnum*                                       EnumType;                                                 // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      EnumName;                                                 // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      bIsEnumNameValid;                                         // 0x0048(0x0001) (Edit, DisableEditOnInstance, EditConst)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
};


// Class AIModule.BlackboardKeyType_Float
// size:0x0000 (0x0030 - 0x0030)
class UBlackboardKeyType_Float : public UBlackboardKeyType
{
public:
};


// Class AIModule.BlackboardKeyType_Int
// size:0x0000 (0x0030 - 0x0030)
class UBlackboardKeyType_Int : public UBlackboardKeyType
{
public:
};


// Class AIModule.BlackboardKeyType_Name
// size:0x0000 (0x0030 - 0x0030)
class UBlackboardKeyType_Name : public UBlackboardKeyType
{
public:
};


// Class AIModule.BlackboardKeyType_NativeEnum
// size:0x0018 (0x0030 - 0x0048)
class UBlackboardKeyType_NativeEnum : public UBlackboardKeyType
{
public:
	class FString                                      EnumName;                                                 // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UEnum*                                       EnumType;                                                 // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
};


// Class AIModule.BlackboardKeyType_Object
// size:0x0008 (0x0030 - 0x0038)
class UBlackboardKeyType_Object : public UBlackboardKeyType
{
public:
	class UObject*                                     BaseClass;                                                // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};


// Class AIModule.BlackboardKeyType_Rotator
// size:0x0000 (0x0030 - 0x0030)
class UBlackboardKeyType_Rotator : public UBlackboardKeyType
{
public:
};


// Class AIModule.BlackboardKeyType_String
// size:0x0010 (0x0030 - 0x0040)
class UBlackboardKeyType_String : public UBlackboardKeyType
{
public:
	class FString                                      StringValue;                                              // 0x0030(0x0010) (ZeroConstructor)
};


// Class AIModule.BlackboardKeyType_Vector
// size:0x0000 (0x0030 - 0x0030)
class UBlackboardKeyType_Vector : public UBlackboardKeyType
{
public:
};


// Class AIModule.BTNode
// size:0x0030 (0x0028 - 0x0058)
class UBTNode : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class FString                                      NodeName;                                                 // 0x0030(0x0010) (Edit, ZeroConstructor)
	class UBehaviorTree*                               TreeAsset;                                                // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBTCompositeNode*                            ParentNode;                                               // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0050(0x0008) MISSED OFFSET
};


// Class AIModule.BTAuxiliaryNode
// size:0x0008 (0x0058 - 0x0060)
class UBTAuxiliaryNode : public UBTNode
{
public:
};


// Class AIModule.BTCompositeNode
// size:0x0038 (0x0058 - 0x0090)
class UBTCompositeNode : public UBTNode
{
public:
	TArray<struct FBTCompositeChild>                   Children;                                                 // 0x0058(0x0010) (ZeroConstructor)
	TArray<class UBTService*>                          Services;                                                 // 0x0068(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET
	unsigned char                                      bApplyDecoratorScope;                                     // 0x0088(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0089(0x0007) MISSED OFFSET
};


// Class AIModule.BTComposite_Selector
// size:0x0000 (0x0090 - 0x0090)
class UBTComposite_Selector : public UBTCompositeNode
{
public:
};


// Class AIModule.BTComposite_Sequence
// size:0x0000 (0x0090 - 0x0090)
class UBTComposite_Sequence : public UBTCompositeNode
{
public:
};


// Class AIModule.BTComposite_SimpleParallel
// size:0x0008 (0x0090 - 0x0098)
class UBTComposite_SimpleParallel : public UBTCompositeNode
{
public:
	TEnumAsByte<EBTParallelMode>                       FinishMode;                                               // 0x0090(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0091(0x0007) MISSED OFFSET
};


// Class AIModule.BTDecorator
// size:0x0008 (0x0060 - 0x0068)
class UBTDecorator : public UBTAuxiliaryNode
{
public:
	unsigned char                                      bInverseCondition;                                        // 0x0060(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	TEnumAsByte<EBTFlowAbortMode>                      FlowAbortMode;                                            // 0x0064(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0065(0x0003) MISSED OFFSET
};


// Class AIModule.BTDecorator_BlackboardBase
// size:0x0028 (0x0068 - 0x0090)
class UBTDecorator_BlackboardBase : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                      BlackboardKey;                                            // 0x0068(0x0028) (Edit)
};


// Class AIModule.BTDecorator_Blackboard
// size:0x0030 (0x0090 - 0x00C0)
class UBTDecorator_Blackboard : public UBTDecorator_BlackboardBase
{
public:
	int                                                IntValue;                                                 // 0x0090(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FloatValue;                                               // 0x0094(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class FString                                      StringValue;                                              // 0x0098(0x0010) (Edit, ZeroConstructor)
	class FString                                      CachedDescription;                                        // 0x00A8(0x0010) (ZeroConstructor)
	unsigned char                                      OperationType;                                            // 0x00B8(0x0001) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EBTBlackboardRestart>                  NotifyObserver;                                           // 0x00B9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x00BA(0x0006) MISSED OFFSET
};


// Class AIModule.BTDecorator_BlueprintBase
// size:0x0038 (0x0068 - 0x00A0)
class UBTDecorator_BlueprintBase : public UBTDecorator
{
public:
	class AAIController*                               AIOwner;                                                  // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      ActorOwner;                                               // 0x0070(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FName>                               ObservedKeyNames;                                         // 0x0078(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0088(0x0010) MISSED OFFSET
	unsigned char                                      bShowPropertyDetails;                                     // 0x0098(0x0001) (Edit, DisableEditOnTemplate)
	unsigned char                                      bCheckConditionOnlyBlackBoardChanges;                     // 0x0098(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsObservingBB;                                           // 0x0098(0x0001)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0099(0x0007) MISSED OFFSET

	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds)//offset:0x13CEB30;
	void ReceiveTick(class AActor* OwnerActor, float DeltaSeconds)//offset:0x13CEB30;
	void ReceiveObserverDeactivatedAI(class AAIController* OwnerController, class APawn* ControlledPawn)//offset:0x13CEB30;
	void ReceiveObserverDeactivated(class AActor* OwnerActor)//offset:0x13CEB30;
	void ReceiveObserverActivatedAI(class AAIController* OwnerController, class APawn* ControlledPawn)//offset:0x13CEB30;
	void ReceiveObserverActivated(class AActor* OwnerActor)//offset:0x13CEB30;
	void ReceiveExecutionStartAI(class AAIController* OwnerController, class APawn* ControlledPawn)//offset:0x13CEB30;
	void ReceiveExecutionStart(class AActor* OwnerActor)//offset:0x13CEB30;
	void ReceiveExecutionFinishAI(class AAIController* OwnerController, class APawn* ControlledPawn, TEnumAsByte<EBTNodeResult> NodeResult)//offset:0x13CEB30;
	void ReceiveExecutionFinish(class AActor* OwnerActor, TEnumAsByte<EBTNodeResult> NodeResult)//offset:0x13CEB30;
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn)//offset:0x13CEB30;
	bool PerformConditionCheck(class AActor* OwnerActor)//offset:0x13CEB30;
	bool IsDecoratorObserverActive()//offset:0x311CEF0;
	bool IsDecoratorExecutionActive()//offset:0x311CEC0;
};


// Class AIModule.BTDecorator_CheckGameplayTagsOnActor
// size:0x0060 (0x0068 - 0x00C8)
class UBTDecorator_CheckGameplayTagsOnActor : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                      ActorToCheck;                                             // 0x0068(0x0028) (Edit)
	EGameplayContainerMatchType                        TagsToMatch;                                              // 0x0090(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0091(0x0007) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0098(0x0020) (Edit)
	class FString                                      CachedDescription;                                        // 0x00B8(0x0010) (ZeroConstructor)
};


// Class AIModule.BTDecorator_CompareBBEntries
// size:0x0058 (0x0068 - 0x00C0)
class UBTDecorator_CompareBBEntries : public UBTDecorator
{
public:
	TEnumAsByte<EBlackBoardEntryComparison>            Operator;                                                 // 0x0068(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0069(0x0007) MISSED OFFSET
	struct FBlackboardKeySelector                      BlackboardKeyA;                                           // 0x0070(0x0028) (Edit)
	struct FBlackboardKeySelector                      BlackboardKeyB;                                           // 0x0098(0x0028) (Edit)
};


// Class AIModule.BTDecorator_ConditionalLoop
// size:0x0000 (0x00C0 - 0x00C0)
class UBTDecorator_ConditionalLoop : public UBTDecorator_Blackboard
{
public:
};


// Class AIModule.BTDecorator_ConeCheck
// size:0x0088 (0x0068 - 0x00F0)
class UBTDecorator_ConeCheck : public UBTDecorator
{
public:
	float                                              ConeHalfAngle;                                            // 0x0068(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
	struct FBlackboardKeySelector                      ConeOrigin;                                               // 0x0070(0x0028) (Edit)
	struct FBlackboardKeySelector                      ConeDirection;                                            // 0x0098(0x0028) (Edit)
	struct FBlackboardKeySelector                      Observed;                                                 // 0x00C0(0x0028) (Edit)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00E8(0x0008) MISSED OFFSET
};


// Class AIModule.BTDecorator_Cooldown
// size:0x0008 (0x0068 - 0x0070)
class UBTDecorator_Cooldown : public UBTDecorator
{
public:
	float                                              CooldownTime;                                             // 0x0068(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
};


// Class AIModule.BTDecorator_DoesPathExist
// size:0x0060 (0x0068 - 0x00C8)
class UBTDecorator_DoesPathExist : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                      BlackboardKeyA;                                           // 0x0068(0x0028) (Edit)
	struct FBlackboardKeySelector                      BlackboardKeyB;                                           // 0x0090(0x0028) (Edit)
	unsigned char                                      bUseSelf;                                                 // 0x00B8(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00B9(0x0003) MISSED OFFSET
	TEnumAsByte<EPathExistanceQueryType>               PathQueryType;                                            // 0x00BC(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00BD(0x0003) MISSED OFFSET
