                                                      /* 该SDK由虚幻引擎工具生成,该工具完全免费! */

                                                      /* 作者:BiliBili:窗边的短脚猫 */

                                                      /* Link:https://space.bilibili.com/3671718 */

#pragma once

// DreadHunger-Win64-Shipping SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DreadHunger-Win64-Shipping_Basic.hpp"
#include "DreadHunger-Win64-Shipping_UMG_classes.hpp"
#include "DreadHunger-Win64-Shipping_CoreUObject_classes.hpp"
#include "DreadHunger-Win64-Shipping_Engine_classes.hpp"
#include "DreadHunger-Win64-Shipping_AIModule_classes.hpp"
#include "DreadHunger-Win64-Shipping_AutoSettings_classes.hpp"
#include "DreadHunger-Win64-Shipping_NavigationSystem_classes.hpp"
#include "DreadHunger-Win64-Shipping_PhysicsCore_classes.hpp"

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum DreadHunger.EDH_HUDLocationType
enum class EDH_HUDLocationType : uint8_t
{
	None                           = 0,
	Fullscreen                     = 1,
	TopLeft                        = 2,
	EDH_MAX                        = 3
};


// Enum DreadHunger.EPlayerTeam
enum class EPlayerTeam : uint8_t
{
	PT_UNDEFINED                   = 0,
	PT_EXPLORERS                   = 1,
	PT_THRALL                      = 2,
	PT_MAX                         = 3
};


// Enum DreadHunger.ECraftingFailReason
enum class ECraftingFailReason : uint8_t
{
	CFR_UNDEFINED                  = 0,
	CFR_REQUIREMENTSNOTMET         = 1,
	CFR_OTHER                      = 2,
	CFR_MAX                        = 3
};


// Enum DreadHunger.EDHInputType
enum class EDHInputType : uint8_t
{
	None                           = 0,
	KeyboardAndMouse               = 1,
	Gamepad                        = 2,
	Touchpad                       = 3,
	EDHInputType_MAX               = 4
};


// Enum DreadHunger.EDH_EntitlementsShopType
enum class EDH_EntitlementsShopType : uint8_t
{
	None                           = 0,
	Hats                           = 1,
	Pipes                          = 2,
	Jewelry                        = 3,
	Masks                          = 4,
	Ship                           = 5,
	EDH_MAX                        = 6
};


// Enum DreadHunger.EPokerGameTimeStatType
enum class EPokerGameTimeStatType : uint8_t
{
	PGTST_UNDEFINED                = 0,
	PGTST_ROUNDTIME                = 1,
	PGTST_PRIZETIME                = 2,
	PGTST_MAX                      = 3
};


// Enum DreadHunger.EShipCustomizationRegion
enum class EShipCustomizationRegion : uint8_t
{
	SCR_UNDEFINED                  = 0,
	SCR_EXTERIOR                   = 1,
	SCR_MESS                       = 2,
	SCR_ARMORY                     = 3,
	SCR_GALLEY                     = 4,
	SCR_HOLD                       = 5,
	SCR_BOILERROOM                 = 6,
	SCR_CAPTAINSQUARTERS           = 7,
	SCR_MAX                        = 8
};


// Enum DreadHunger.ETotemSpellTiers
enum class ETotemSpellTiers : uint8_t
{
	TST_UNDEFINED                  = 0,
	TST_ZERO                       = 1,
	TST_ONE                        = 2,
	TST_TWO                        = 3,
	TST_THREE                      = 4,
	TST_MAX                        = 5
};


// Enum DreadHunger.EDoorOpenState
enum class EDoorOpenState : uint8_t
{
	DOS_CLOSED                     = 0,
	DOS_OPENFORWARD                = 1,
	DOS_OPENFORWARD_FORCED         = 2,
	DOS_OPENBACKWARD               = 3,
	DOS_OPENBACKWARD_FORCED        = 4,
	DOS_MAX                        = 5
};


// Enum DreadHunger.EPlayingCardRank
enum class EPlayingCardRank : uint8_t
{
	PCR_UNDEFINED                  = 0,
	PCR_ACE                        = 1,
	PCR_TWO                        = 2,
	PCR_THREE                      = 3,
	PCR_FOUR                       = 4,
	PCR_FIVE                       = 5,
	PCR_SIX                        = 6,
	PCR_SEVEN                      = 7,
	PCR_EIGHT                      = 8,
	PCR_NINE                       = 9,
	PCR_TEN                        = 10,
	PCR_JACK                       = 11,
	PCR_QUEEN                      = 12,
	PCR_KING                       = 13,
	PCR_HIGH_ACE                   = 14,
	PCR_MAX                        = 15
};


// Enum DreadHunger.EPokerHandRank
enum class EPokerHandRank : uint8_t
{
	PHR_UNDEFINED                  = 0,
	PHR_HIGHCARD                   = 1,
	PHR_PAIR                       = 2,
	PHR_TWOPAIR                    = 3,
	PHR_THREEOFAKIND               = 4,
	PHR_STRAIGHT                   = 5,
	PHR_FLUSH                      = 6,
	PHR_FULLHOUSE                  = 7,
	PHR_FOUROFAKIND                = 8,
	PHR_STRAIGHTFLUSH              = 9,
	PHR_ROYALFLUSH                 = 10,
	PHR_MAX                        = 11
};


// Enum DreadHunger.EPlayingCardSuit
enum class EPlayingCardSuit : uint8_t
{
	PCS_UNDEFINED                  = 0,
	PCS_HEARTS                     = 1,
	PCS_DIAMONDS                   = 2,
	PCS_CLUBS                      = 3,
	PCS_SPADES                     = 4,
	PCS_MAX                        = 5
};


// Enum DreadHunger.EAISpawnMethod
enum class EAISpawnMethod : uint8_t
{
	ASM_UNDEFINED                  = 0,
	ASM_EQS                        = 1,
	ASM_DIRECT                     = 2,
	ASM_MAX                        = 3
};


// Enum DreadHunger.EAttackType
enum class EAttackType : uint8_t
{
	MELEE                          = 0,
	AOE                            = 1,
	PROJECTILE                     = 2,
	EAttackType_MAX                = 3
};


// Enum DreadHunger.EAttackMovementFlags
enum class EAttackMovementFlags : uint8_t
{
	NONE                           = 0,
	WALKING                        = 1,
	FALLING                        = 2,
	SWIMMING                       = 3,
	EAttackMovementFlags_MAX       = 4
};


// Enum DreadHunger.EAttackImpulseDirection
enum class EAttackImpulseDirection : uint8_t
{
	AID_UNDEFINED                  = 0,
	AID_FORWARD                    = 1,
	AID_LEFT                       = 2,
	AID_RIGHT                      = 3,
	AID_MAX                        = 4
};


// Enum DreadHunger.EAttackAnimationSlot
enum class EAttackAnimationSlot : uint8_t
{
	AAS_FULLBODY                   = 0,
	AAS_UPPERBODY                  = 1,
	AAS_HEAD                       = 2,
	AAS_MAX                        = 3
};


// Enum DreadHunger.EAIPointOfInterest
enum class EAIPointOfInterest : uint8_t
{
	POE_UNDEFINED                  = 0,
	POE_NITRO                      = 1,
	POE_CAVE                       = 2,
	POE_CLIFF                      = 3,
	POE_CAMP                       = 4,
	POE_MAX                        = 5
};


// Enum DreadHunger.EPlayingCardNotifyType
enum class EPlayingCardNotifyType : uint8_t
{
	PCN_UNDEFINED                  = 0,
	PCN_PUTINTOHAND                = 1,
	PCN_ATTACHPENDINGPICKUP        = 2,
	PCN_ATTACHPENDINGDROP          = 3,
	PCN_DROP                       = 4,
	PCN_MAX                        = 5
};


// Enum DreadHunger.EBearTrapState
enum class EBearTrapState : uint8_t
{
	BTS_OPEN                       = 0,
	BTS_CLOSED                     = 1,
	BTS_BROKEN                     = 2,
	BTS_RELEASED                   = 3,
	BTS_MAX                        = 4
};


// Enum DreadHunger.EDH_CanTravelToServerResult
enum class EDH_CanTravelToServerResult : uint8_t
{
	Success                        = 0,
	Failed_TravellingToSelf        = 1,
	Failed_TravellingToSameAddress = 2,
	Failed_WaitingForOthersToLeave = 3,
	Failed_NoServerURI             = 4,
	EDH_MAX                        = 5
};


// Enum DreadHunger.EDHCustomMovementMode
enum class EDHCustomMovementMode : uint8_t
{
	DHMOVE_None                    = 0,
	DHMOVE_Climbing                = 1,
	DHMOVE_Crawling                = 2,
	DHMOVE_MAX                     = 3
};


// Enum DreadHunger.ECraftingSpawnPosition
enum class ECraftingSpawnPosition : uint8_t
{
	CPP_UNDEFINED                  = 0,
	CPP_OWNER                      = 1,
	CPP_INGREDIENTS                = 2,
	CPP_MAX                        = 3
};


// Enum DreadHunger.ECraftingIngredientRules
enum class ECraftingIngredientRules : uint8_t
{
	CIR_UNDEFINED                  = 0,
	CIR_ALL                        = 1,
	CIR_ANY                        = 2,
	CIR_ANYUSEALL                  = 3,
	CPM_MAX                        = 4,
	ECraftingIngredientRules_MAX   = 5
};


// Enum DreadHunger.ECraftingProgressMethod
enum class ECraftingProgressMethod : uint8_t
{
	CPM_UNDEFINED                  = 0,
	CPM_AUTOMATIC                  = 1,
	CPM_MANUALSTART                = 2,
	CPM_MANUAL                     = 3,
	CPM_MAX                        = 4
};


// Enum DreadHunger.EInventoryCraftingRecipient
enum class EInventoryCraftingRecipient : uint8_t
{
	ICR_UNDEFINED                  = 0,
	ICR_OWNER                      = 1,
	ICR_INSTIGATOR                 = 2,
	ICR_MAX                        = 3
};


// Enum DreadHunger.ECraftingMethod
enum class ECraftingMethod : uint8_t
{
	CM_UNDEFINED                   = 0,
	CM_GROUND                      = 1,
	CM_INVENTORY                   = 2,
	CM_MAX                         = 3
};


// Enum DreadHunger.ECraftingEffectSpawnStyle
enum class ECraftingEffectSpawnStyle : uint8_t
{
	CES_UNDEFINED                  = 0,
	CES_SINGLE                     = 1,
	CES_PERINGREDIENT              = 2,
	CES_MAX                        = 3
};


// Enum DreadHunger.ECraftingComponentFamily
enum class ECraftingComponentFamily : uint8_t
{
	CCF_UNDEFINED                  = 0,
	CCF_MEATS                      = 1,
	CCF_METALS                     = 2,
	CCF_FUEL                       = 3,
	CCF_ARROWHEADS                 = 4,
	CCF_REPAIRABLE                 = 5,
	CCF_MAX                        = 6
};


// Enum DreadHunger.ESettingValueDisplayType
enum class ESettingValueDisplayType : uint8_t
{
	VDT_PERCENT                    = 0,
	VDT_MULTIPLIER                 = 1,
	VDT_NUMBER                     = 2,
	VDT_MAX                        = 3
};


// Enum DreadHunger.ESettingValueAdjustmentType
enum class ESettingValueAdjustmentType : uint8_t
{
	VAT_SLIDER                     = 0,
	VAT_CHECKBOX                   = 1,
	VAT_MAX                        = 2
};


// Enum DreadHunger.ECustomGameSetting
enum class ECustomGameSetting : uint8_t
{
	CGS_UNDEFINED                  = 0,
	CGS_THRALLCOUNT                = 1,
	CGS_BLIZZARDDELAY              = 2,
	CGS_DAYLENGTH                  = 3,
	CGS_PREDATORDAMAGE             = 4,
	CGS_COLD                       = 5,
	CGS_HUNGER                     = 6,
	CGS_COALBURN                   = 7,
	CGS_MAX                        = 8
};


// Enum DreadHunger.EDH_DateTimeStyleType
enum class EDH_DateTimeStyleType : uint8_t
{
	Default                        = 0,
	Short                          = 1,
	Medium                         = 2,
	Long                           = 3,
	Full                           = 4,
	EDH_MAX                        = 5
};


// Enum DreadHunger.EDoorOpenStyle
enum class EDoorOpenStyle : uint8_t
{
	DOS_UNDEFINED                  = 0,
	DOS_SWING                      = 1,
	DOS_SLIDE                      = 2,
	DOS_MAX                        = 3
};


// Enum DreadHunger.EDH_EscapePriority
enum class EDH_EscapePriority : uint8_t
{
	None                           = 0,
	DebugControls                  = 1,
	LootContainerBase              = 2,
	Journal                        = 3,
	EntitlementsShop               = 4,
	LobbyMissionMap                = 5,
	OnlineFriendsList              = 6,
	ReplayBrowser                  = 7,
	Overlay                        = 8,
	Scoreboard                     = 9,
	EscapeMenu                     = 10,
	Settings                       = 11,
	VOIPEchoTest                   = 12,
	VOIPProblems                   = 13,
	LoadingScreen                  = 14,
	EDH_MAX                        = 15
};


// Enum DreadHunger.EDHCompleteVersionFlags
enum class EDHCompleteVersionFlags : uint8_t
{
	None                           = 0,
	Version                        = 1,
	Changelist                     = 2,
	Environment                    = 3,
	EDHCompleteVersionFlags_MAX    = 4
};


// Enum DreadHunger.EImpactDecalOrientation
enum class EImpactDecalOrientation : uint8_t
{
	IDO_UNDEFINED                  = 0,
	IDO_INSTIGATOR                 = 1,
	IDO_RANDOM                     = 2,
	IDO_VELOCITY                   = 3,
	IDO_MAX                        = 4
};


// Enum DreadHunger.EImpactCameraShakeTarget
enum class EImpactCameraShakeTarget : uint8_t
{
	CST_UNDEFINED                  = 0,
	CST_INSTIGATOR                 = 1,
	CST_RECIPIENT                  = 2,
	CST_BOTH                       = 3,
	CST_MAX                        = 4
};


// Enum DreadHunger.EPickupThrowState
enum class EPickupThrowState : uint8_t
{
	PTS_NONE                       = 0,
	PTS_DROPPED                    = 1,
	PTS_THROWN                     = 2,
	PTS_MAX                        = 3
};


// Enum DreadHunger.EDropTableSpawnMethod
enum class EDropTableSpawnMethod : uint8_t
{
	DTSM_UNDEFINED                 = 0,
	DTSM_TRANSACT                  = 1,
	DTSM_IMMEDIATE                 = 2,
	DTSM_MAX                       = 3
};


// Enum DreadHunger.EEffectListPlaybackOrder
enum class EEffectListPlaybackOrder : uint8_t
{
	LPO_UNDEFINED                  = 0,
	LPO_RANDOM                     = 1,
	LPO_SEQUENTIAL                 = 2,
	LPO_MAX                        = 3
};


// Enum DreadHunger.EInventoryEffectFilter
enum class EInventoryEffectFilter : uint8_t
{
	IEF_ALL                        = 0,
	IEF_AUDIO                      = 1,
	IEF_ANIMATION                  = 2,
	IEF_PARTICLES                  = 3,
	IEF_MAX                        = 4
};


// Enum DreadHunger.EInventoryDropMethod
enum class EInventoryDropMethod : uint8_t
{
	IDM_INPUT                      = 0,
	IDM_FORCED                     = 1,
	IDM_SCRIPT                     = 2,
	IDM_MAX                        = 3
};


// Enum DreadHunger.EInventoryTransactionRules
enum class EInventoryTransactionRules : uint8_t
{
	ITR_READONLY                   = 0,
	ITR_TAKEONLY                   = 1,
	ITR_GIVEONLY                   = 2,
	ITR_GIVEANDTAKE                = 3,
	ITR_MAX                        = 4
};


// Enum DreadHunger.EInventoryStateFlags
enum class EInventoryStateFlags : uint8_t
{
	ISF_None                       = 0,
	ISF_Poisoned                   = 1,
	ISF_MAX                        = 2
};


// Enum DreadHunger.EInventoryAnimMontageState
enum class EInventoryAnimMontageState : uint8_t
{
	IMS_UNDEFINED                  = 0,
	IMS_GRABBING                   = 1,
	IMS_EQUIPPING                  = 2,
	IMS_IDLING                     = 3,
	IMS_AIMING                     = 4,
	IMS_USING                      = 5,
	IMS_RELOADING                  = 6,
	IMS_DROPPING                   = 7,
	IMS_THROWING                   = 8,
	IMS_HOLSTERED                  = 9,
	IMS_MAX                        = 10
};


// Enum DreadHunger.EInventoryAimingStyle
enum class EInventoryAimingStyle : uint8_t
{
	IAS_UNDEFINED                  = 0,
	IAS_HOLD                       = 1,
	IAS_TOGGLE                     = 2,
	IAS_MAX                        = 3
};


// Enum DreadHunger.EInventoryDominantHand
enum class EInventoryDominantHand : uint8_t
{
	IDH_UNDEFINED                  = 0,
	IDH_RIGHT                      = 1,
	IDH_LEFT                       = 2,
	IDH_MAX                        = 3
};


// Enum DreadHunger.EInventoryType
enum class EInventoryType : uint8_t
{
	CCT_UNDEFINED                  = 0,
	CCT_STICK                      = 1,
	CCT_STONE                      = 2,
	CCT_GUNPOWDER                  = 3,
	CCT_LEADINGOT                  = 4,
	CCT_IRONINGOT                  = 5,
	CCT_WHETSTONE                  = 6,
	CCT_COAL                       = 7,
	CCT_WOLFPELT                   = 8,
	CCT_BLUBBER                    = 9,
	CCT_SINEW                      = 10,
	CCT_BONE                       = 11,
	CCT_TRUTHPLANT                 = 12,
	CCT_HUMANBODYPART              = 13,
	CCT_ANIMALPART                 = 14,
	CCT_FLINT                      = 15,
	CCT_FIRE                       = 16,
	CCT_CODE                       = 17,
	CCT_NAILS                      = 18,
	CCT_QUEST                      = 19,
	CCT_RAWMEAT                    = 20,
	CCT_COOKEDMEAT                 = 21,
	CCT_STEW                       = 22,
	CCT_TEA                        = 23,
	CCT_BONEDAGGER                 = 24,
	CCT_BEARTRAP                   = 25,
	CCT_PISTOL                     = 26,
	CCT_MUSKET                     = 27,
	CCT_SWORD                      = 28,
	CCT_OLDSWORD                   = 29,
	CCT_CLEAVER                    = 30,
	CCT_ICEAXE                     = 31,
	CCT_WOODAXE                    = 32,
	CCT_HARPOON                    = 33,
	CCT_SHOVEL                     = 34,
	CCT_FISTS                      = 35,
	CCT_BOW                        = 36,
	CCT_COALBARREL                 = 37,
	CCT_POWDERKEG                  = 38,
	CCT_NITRO                      = 39,
	CCT_LAUDANUM                   = 40,
	CCT_SYRINGE                    = 41,
	CCT_LANTERN                    = 42,
	CCT_FLINTLOCKAMMO              = 43,
	CCT_GUNPARTS                   = 44,
	CCT_SKELETONKEY                = 45,
	CCT_UNIFORM                    = 46,
	CCT_SPYGLASS                   = 47,
	CCT_POISON                     = 48,
	CCT_ANTIDOTE                   = 49,
	CCT_HERBS                      = 50,
	CCT_CAPTAINKEY                 = 51,
	CCT_ARROWS                     = 52,
	CCT_PHONOGRAPH                 = 53,
	CCT_MAX                        = 54
};


// Enum DreadHunger.EDH_LobbyTutorialGoal
enum class EDH_LobbyTutorialGoal : uint8_t
{
	LTG_UNDEFINED                  = 0,
	LTG_CHOOSEMISSION              = 1,
	LTG_STARTBOILER                = 2,
	LTG_HELMSHIP                   = 3,
	LTG_BOARDSHIP                  = 4,
	IMS_MAX                        = 5,
	EDH_MAX                        = 6
};


// Enum DreadHunger.EDH_LogVerbosity
enum class EDH_LogVerbosity : uint8_t
{
	Log                            = 0,
	Warning                        = 1,
	Error                          = 2,
	EDH_MAX                        = 3
};


// Enum DreadHunger.EDH_MatchReplayVersion
enum class EDH_MatchReplayVersion : uint8_t
{
	Unknown                        = 0,
	Legacy                         = 1,
	SwitchToCustomFileFormat       = 2,
	Max                            = 3
};


// Enum DreadHunger.EMerchantDialogueType
enum class EMerchantDialogueType : uint8_t
{
	MDT_UNDEFINED                  = 0,
	MDT_GREETING                   = 1,
	MDT_FAREWELL                   = 2,
	MDT_ENTERSHOP                  = 3,
	MDT_EXITSHOP                   = 4,
	MDT_CALLOUT                    = 5,
	MDT_MAX                        = 6
};


// Enum DreadHunger.EDH_MOTDType
enum class EDH_MOTDType : uint8_t
{
	None                           = 0,
	Info                           = 1,
	Error                          = 2,
	Warning                        = 3,
	EDH_MAX                        = 4
};


// Enum DreadHunger.EDH_OnlineNameType
enum class EDH_OnlineNameType : uint8_t
{
	None                           = 0,
	Steam                          = 1,
	EDH_MAX                        = 2
};


// Enum DreadHunger.EDH_CanInventoryBeInteractedWithResult
enum class EDH_CanInventoryBeInteractedWithResult : uint8_t
{
	Success                        = 0,
	StackLimitReached              = 1,
	NoSlotsAvailable               = 2,
	NoInventory                    = 3,
	EDH_MAX                        = 4
};


// Enum DreadHunger.ECosmeticLimbDetachmentHandling
enum class ECosmeticLimbDetachmentHandling : uint8_t
{
	LDH_UNDEFINED                  = 0,
	LDH_ATTACH                     = 1,
	LDH_DETACH                     = 2,
	LDH_MAX                        = 3
};


// Enum DreadHunger.EPlayerCosmeticSlot
enum class EPlayerCosmeticSlot : uint8_t
{
	PCS_UNDEFINED                  = 0,
	PCS_HEAD                       = 1,
	PCS_FOREHEAD                   = 2,
	PCS_EYES                       = 3,
	PCS_EARS                       = 4,
	PCS_MOUTH                      = 5,
	PCS_BODY                       = 6,
	PCS_HANDS                      = 7,
	PCS_MAX                        = 8
};


// Enum DreadHunger.EDH_PlayerReportReasonType
enum class EDH_PlayerReportReasonType : uint8_t
{
	None                           = 0,
	Griefing                       = 1,
	Cheating                       = 2,
	CommsAbuse                     = 3,
	AFK                            = 4,
	EDH_MAX                        = 5
};


// Enum DreadHunger.EProjectileImpactHandling
enum class EProjectileImpactHandling : uint8_t
{
	PIH_DESTROY                    = 0,
	PIH_ATTACH                     = 1,
	PID_NOTHING                    = 2,
	EProjectileImpactHandling_MAX  = 3
};


// Enum DreadHunger.EDH_RestoreInvitesResult
enum class EDH_RestoreInvitesResult : uint8_t
{
	NoInvites                      = 0,
	HasInvites                     = 1,
	NoSessionObject                = 2,
	NotSuccessful                  = 3,
	EDH_MAX                        = 4
};


// Enum DreadHunger.EPerkValueComputation
enum class EPerkValueComputation : uint8_t
{
	PVC_UNDEFINED                  = 0,
	PVC_MULTIPLICATIVE             = 1,
	PVC_ADDITIVE                   = 2,
	PVC_MAX                        = 3
};


// Enum DreadHunger.EShipCosmeticType
enum class EShipCosmeticType : uint8_t
{
	SCT_UNDEFINED                  = 0,
	SCT_BOW                        = 1,
	SCT_HELM                       = 2,
	SCT_FLAGS                      = 3,
	SCT_HULL                       = 4,
	SCT_DECK                       = 5,
	SCT_WALLS                      = 6,
	SCT_FURNITURE                  = 7,
	SCT_DECORATIONS                = 8,
	SCT_LIGHTS                     = 9,
	SCT_MAX                        = 10
};


// Enum DreadHunger.ESpawnRotation
enum class ESpawnRotation : uint8_t
{
	SR_VOLUME                      = 0,
	SR_RANDOM                      = 1,
	SR_GROUND                      = 2,
	SR_GROUNDRANDOM                = 3,
	SR_MAX                         = 4
};


// Enum DreadHunger.EDH_TestCanJoinResult
enum class EDH_TestCanJoinResult : uint8_t
{
	Success                        = 0,
	Unknown                        = 1,
	GameHasStarted                 = 2,
	EmptyLobby                     = 3,
	LobbyKicked                    = 4,
	ListenServerNotReady           = 5,
	FullLobby                      = 6,
	InvalidURI                     = 7,
	EDH_MAX                        = 8
};


// Enum DreadHunger.EActorCleanupPhase
enum class EActorCleanupPhase : uint8_t
{
	ACP_AFTEROUTRO                 = 0,
	ACP_BEFOREOUTRO                = 1,
	ACP_MAX                        = 2
};


// Enum DreadHunger.EChapterAISpawnMethod
enum class EChapterAISpawnMethod : uint8_t
{
	ASM_AUTOMATIC                  = 0,
	ASM_MANUL                      = 1,
	ASM_MAX                        = 2
};


// Enum DreadHunger.EConceptExpirationStyle
enum class EConceptExpirationStyle : uint8_t
{
	CES_UNDEFINED                  = 0,
	CES_AUTOMATIC                  = 1,
	CES_ANYBIND                    = 2,
	CES_ALLBINDS                   = 3,
	CES_MAX                        = 4
};


// Enum DreadHunger.ETriggerVolumeInstigator
enum class ETriggerVolumeInstigator : uint8_t
{
	TVI_UNDEFINED                  = 0,
	TVI_PLAYER                     = 1,
	TVI_SHIP                       = 2,
	TVI_EITHER                     = 3,
	TVI_MAX                        = 4
};


// Enum DreadHunger.EPlayerVoiceType
enum class EPlayerVoiceType : uint8_t
{
	PVT_MALE                       = 0,
	PVT_FEMALE                     = 1,
	PVT_MAX                        = 2
};


// Enum DreadHunger.EPlayerTalismanPerk
enum class EPlayerTalismanPerk : uint8_t
{
	PTP_UNDEFINED                  = 0,
	PTP_COLDRESIST                 = 1,
	PTP_FOODVALUE                  = 2,
	PTP_HUNGERRATE                 = 3,
	PTP_HUNGERRATE_NIGHT           = 4,
	PTP_ANIMALDAMAGE               = 5,
	PTP_ANIMALAGGRO                = 6,
	PTP_FOGVISION                  = 7,
	PTP_STAMINADRAIN               = 8,
	PTP_REVIVESPEED                = 9,
	PTP_POKERLUCK                  = 10,
	PTP_VOICERANGE                 = 11,
	PTP_FALLDAMAGE                 = 12,
	PTP_FOOTSTEPVOLUME             = 13,
	PTP_FOODHEALTHREGEN            = 14,
	PTP_MAX                        = 15
};


// Enum DreadHunger.EPlayerRolePerk
enum class EPlayerRolePerk : uint8_t
{
	PRP_UNDEFINED                  = 0,
	PRP_SHIPHANDLING               = 1,
	PTR_TRINKETCHANCE              = 2,
	PTR_STOVESPEED                 = 3,
	PTR_MEDBOOST                   = 4,
	PTR_WORKBENCHSPEED             = 5,
	PTR_ANIMALRESIST               = 6,
	PTR_FOGVIS                     = 7,
	PTR_RELOADSPEED                = 8,
	PTR_MEATHARVESTSPEED           = 9,
	PTR_GROUNDSPEED                = 10,
	PTR_MAX                        = 11,
	EPlayerRolePerk_MAX            = 12
};


// Enum DreadHunger.EPlayerExperienceRank
enum class EPlayerExperienceRank : uint8_t
{
	PER_UNDEFINED                  = 0,
	PER_LANDSMAN                   = 1,
	PER_SEAMAN                     = 2,
	PER_ABLESEAMAN                 = 3,
	PER_PETTYOFFICER               = 4,
	PER_WARRANTOFFICER             = 5,
	PER_LIEUTENANT                 = 6,
	PER_COMMANDER                  = 7,
	PER_ADMIRAL                    = 8,
	PER_MAX                        = 9
};


// Enum DreadHunger.EPlayerTeamRole
enum class EPlayerTeamRole : uint8_t
{
	PTR_UNDEFINED                  = 0,
	PTR_CAPTAIN                    = 1,
	PTR_ENGINEER                   = 2,
	PTR_HUNTER                     = 3,
	PTR_COOK                       = 4,
	PTR_NAVIGATOR                  = 5,
	PTR_CHAPLAIN                   = 6,
	PTR_MARINE                     = 7,
	PTR_DOCTOR                     = 8,
	PTR_UNKNOWN                    = 9,
	PTR_MAX                        = 10
};


// Enum DreadHunger.EDHPlayerstartLocation
enum class EDHPlayerstartLocation : uint8_t
{
	PST_UNDEFINED                  = 0,
	PST_POKERROOM                  = 1,
	PST_BRIG                       = 2,
	PST_CORPSE                     = 3,
	PST_MAX                        = 4
};


// Enum DreadHunger.EClimbableActorType
enum class EClimbableActorType : uint8_t
{
	CAT_NONE                       = 0,
	CAT_LADDER                     = 1,
	CAT_ICEWALL                    = 2,
	CAT_MAX                        = 3
};


// Enum DreadHunger.ESpellTargetingStyle
enum class ESpellTargetingStyle : uint8_t
{
	STS_UNDEFINED                  = 0,
	STS_TARGET                     = 1,
	STS_GLOBAL                     = 2,
	STS_CASTER                     = 3,
	STS_MAX                        = 4
};


// Enum DreadHunger.EStatScoringValue
enum class EStatScoringValue : uint8_t
{
	SMD_UNDEFINED                  = 0,
	SMD_NEGATIVE_GIGANTIC          = 1,
	SMD_NEGATIVE_MASSIVE           = 2,
	SMD_NEGATIVE_MAJOR             = 3,
	SMD_NEGATIVE_MODERATE          = 4,
	SMD_NEGATIVE_SMALL             = 5,
	SMD_NEGATIVE_MINOR             = 6,
	SMD_NEGATIVE_SLIGHT            = 7,
	SMD_NEGATIVE_TRIVIAL           = 8,
	SMD_NEUTRAL                    = 9,
	SMD_POSITIVE_TRIVIAL           = 10,
	SMD_POSITIVE_SLIGHT            = 11,
	SMD_POSITIVE_MINOR             = 12,
	SMD_POSITIVE_SMALL             = 13,
	SMD_POSITIVE_MODERATE          = 14,
	SMD_POSITIVE_MAJOR             = 15,
	SMD_POSITIVE_MASSIVE           = 16,
	SMD_POSITIVE_GIGANTIC          = 17,
	SMD_MAX                        = 18
};


// Enum DreadHunger.ERelativeTeamAlignment
enum class ERelativeTeamAlignment : uint8_t
{
	RTA_UNDEFINED                  = 0,
	RTA_ALLY                       = 1,
	RTA_ENEMY                      = 2,
	RTA_SELF                       = 3,
	RTA_MAX                        = 4
};


// Enum DreadHunger.EGameOverReason
enum class EGameOverReason : uint8_t
{
	GOR_UNDEFINED                  = 0,
	GOR_EXPLORERS_ESCAPED          = 1,
	GOR_EXPLORERS_DIED             = 2,
	GOR_EXPLORERS_ABANDONED        = 3,
	GOR_SHIP_SANK                  = 4,
	PT_MAX                         = 5,
	EGameOverReason_MAX            = 6
};


// Enum DreadHunger.EDHTeam
enum class EDHTeam : uint8_t
{
	HumanTeam                      = 0,
	RabbitTeam                     = 1,
	WolfTeam                       = 2,
	CannibalTeam                   = 3,
	BearTeam                       = 4,
	WendigoTeam                    = 5,
	NoTeam                         = 6,
	EDHTeam_MAX                    = 7
};


// Enum DreadHunger.ETemperatureScale
enum class ETemperatureScale : uint8_t
{
	TS_UNDEFINED                   = 0,
	TS_KELVIN                      = 1,
	TS_FAHRENHEIT                  = 2,
	TS_CELSIUS                     = 3,
	TS_MAX                         = 4
};


// Enum DreadHunger.EPlayerAwardType
enum class EPlayerAwardType : uint8_t
{
	PAT_UNDEFINED                  = 0,
	PAT_COWARDLY                   = 1,
	PAT_SLY                        = 2,
	PAT_BLOODTHIRSTY               = 3,
	PAT_HONORABLE                  = 4,
	PAT_HELPFUL                    = 5,
	PAT_MAX                        = 6
};


// Enum DreadHunger.EPlayerPerformanceGrade
enum class EPlayerPerformanceGrade : uint8_t
{
	PPG_UNDEFINED                  = 0,
	PPG_FMINUS                     = 1,
	PPG_F                          = 2,
	PPG_FPLUS                      = 3,
	PPG_DMINUS                     = 4,
	PPG_D                          = 5,
	PPG_DPLUS                      = 6,
	PPG_CMINUS                     = 7,
	PPG_C                          = 8,
	PPG_CPLUS                      = 9,
	PPG_BMINUS                     = 10,
	PPG_B                          = 11,
	PPG_BPLUS                      = 12,
	PPG_AMINUS                     = 13,
	PPG_A                          = 14,
	PPG_APLUS                      = 15,
	PPG_S                          = 16,
	PPG_MAX                        = 17
};


// Enum DreadHunger.EPlayerMatchStatType
enum class EPlayerMatchStatType : uint8_t
{
	PMS_UNDEFINED                  = 0,
	PMS_KILLS_START                = 1,
	PMS_KILL_PLAYER_SELF           = 2,
	PMS_KILL_PLAYER_ENEMY          = 3,
	PMS_KILL_PLAYER_ALLY           = 4,
	PMS_KILL_WOLF                  = 5,
	PMS_KILL_RABBIT                = 6,
	PMS_KILL_BEAR                  = 7,
	PMS_KILL_SEAL                  = 8,
	PMS_KILL_CANNIBAL              = 9,
	PMS_KILLS_END                  = 10,
	PMS_DOWN_SELF                  = 11,
	PMS_DOWN_ALLY                  = 12,
	PMS_DOWN_ENEMY                 = 13,
	PMS_REVIVE_SELF                = 14,
	PMS_REVIVE_ALLY                = 15,
	PMS_REVIVE_ENEMY               = 16,
	PMS_HEAL_SELF                  = 17,
	PMS_HEAL_ALLY                  = 18,
	PMS_HEAL_ENEMY                 = 19,
	PMS_FEED_SELF                  = 20,
	PMS_FEED_ALLY                  = 21,
	PMS_FEED_ENEMY                 = 22,
	PMS_POISON_SELF                = 23,
	PMS_POISON_ALLY                = 24,
	PMS_POISON_ENEMY               = 25,
	PMS_CURE_SELF                  = 26,
	PMS_CURE_ALLY                  = 27,
	PMS_CURE_ENEMY                 = 28,
	PMS_WARM_SELF                  = 29,
	PMS_WARM_ALLY                  = 30,
	PMS_WARM_ENEMY                 = 31,
	PMS_JAILBREAK_ALLY             = 32,
	PMS_JAILBREAK_ENEMY            = 33,
	PMS_DAMAGE_ALLY                = 34,
	PMS_DAMAGE_ENEMY               = 35,
	PMS_DAMAGE_BEAR                = 36,
	PMS_STAYING_ALIVE              = 37,
	PMS_EMBEDDED                   = 38,
	PMS_ALLY_ESCAPED               = 39,
	PMS_ENEMY_ESCAPED              = 40,
	PMS_CRAFT_STEW                 = 41,
	PMS_CRAFT_PISTOL               = 42,
	PMS_CRAFT_MUSKET               = 43,
	PMS_CRAFT_WOODAXE              = 44,
	PMS_CRAFT_ICEAXE               = 45,
	PMS_CRAFT_SYRINGE              = 46,
	PMS_COAL_DESTROYED             = 47,
	PMS_NITRO_CARRY                = 48,
	PMS_NITRO_CARRY_ASSIST         = 49,
	PMS_NITRO_DESTROY              = 50,
	PMS_ICEBERG_DAMAGE             = 51,
	PMS_SMALL_ICEBERG_DESTROYED    = 52,
	PMS_LARGE_ICEBERG_DESTROYED    = 53,
	PMS_WIN_MATCH                  = 54,
	PMS_BOILER_FUEL                = 55,
	PMS_BOILER_SABOTAGE            = 56,
	PMS_SHIP_BADPARK               = 57,
	PMS_SHIP_MOVEUP                = 58,
	PMS_SHIP_MOVEBACK              = 59,
	PMS_SHIP_SLOWDRIVE             = 60,
	PMS_SHIP_REPAIR                = 61,
	PMS_SHIP_DAMAGE                = 62,
	PMS_SHIP_SINK                  = 63,
	PMS_STOLE_FOOD                 = 64,
	PMS_TOTEM_BUILT                = 65,
	PMS_TOTEM_DESTROYED            = 66,
	PMS_BONECHARM_DESTROYED        = 67,
	PMS_SPELL_WHITEOUT             = 68,
	PMS_SPELL_CANNIBALS            = 69,
	PMS_SPELL_SPIRITWALK           = 70,
	PMS_SPELL_GALE                 = 71,
	PMS_STOWAWAY                   = 72,
	PMS_POKER_WINS                 = 73,
	PMS_CHEATER                    = 74,
	PMS_SPELL_HYSTERIA             = 75,
	PMS_SPELL_DOPPELGANGER         = 76,
	PMS_SPELL_BLOODMOON            = 77,
	PMS_SPELL_HUSH                 = 78,
	PMS_BOILER_BOOST               = 79,
	PMS_KILL_RAT                   = 80,
	PMS_MAX                        = 81
};


// Enum DreadHunger.ECrewDialogueType
enum class ECrewDialogueType : uint8_t
{
	CDT_UNDEFINED                  = 0,
	CDT_GREETING                   = 1,
	CDT_MUSING                     = 2,
	CDT_FF_WARNING                 = 3,
	CDT_FF_ATTACK                  = 4,
	CDT_MAX                        = 5
};


// Enum DreadHunger.ECharacterHealthState
enum class ECharacterHealthState : uint8_t
{
	CHS_UNDEFINED                  = 0,
	CHS_DEAD                       = 1,
	CHS_BADLYINJURED               = 2,
	CHS_INJURED                    = 3,
	CHS_HEALTHY                    = 4,
	CHS_MAX                        = 5
};


// Enum DreadHunger.ECharacterDeathState
enum class ECharacterDeathState : uint8_t
{
	CDS_ALIVE                      = 0,
	CDS_DEAD                       = 1,
	CDS_CARCASS                    = 2,
	CDS_OBLITERATED                = 3,
	CDS_MAX                        = 4
};


// Enum DreadHunger.ETutorialChapters
enum class ETutorialChapters : uint8_t
{
	CHAPTER_UNDEFINED              = 0,
	CHAPTER_ONE                    = 1,
	CHAPTER_TWO                    = 2,
	CHAPTER_THREE                  = 3,
	CHAPTER_FOUR                   = 4,
	CHAPTER_FIVE                   = 5,
	CHAPTER_SIX                    = 6,
	CHAPTER_MAX                    = 7
};


// Enum DreadHunger.ESpecialEventType
enum class ESpecialEventType : uint8_t
{
	SET_UNDEFINED                  = 0,
	SET_AUTUMN                     = 1,
	SET_HALLOWEEN                  = 2,
	SET_CHRISTMAS                  = 3,
	SET_SPRING                     = 4,
	SET_FRANKLINLAUNCH             = 5,
	SET_SUMMER                     = 6,
	SET_LUNARNEWYEAR               = 7,
	SET_TEST                       = 8,
	SET_MAX                        = 9
};


// Enum DreadHunger.EShipSpacePartition
enum class EShipSpacePartition : uint8_t
{
	SSP_UNDEFINED                  = 0,
	SSP_EXTERIOR                   = 1,
	SSP_ENGINEROOM                 = 2,
	SSP_CAPTAINROOM                = 3,
	SSP_POKERROOM                  = 4,
	SSP_CORRIDORFORE               = 5,
	SSP_CORRIDORAFT                = 6,
	SSP_KITCHEN                    = 7,
	SSP_HOLDFORE                   = 8,
	SSP_HOLDAFT                    = 9,
	SSP_MAX                        = 10
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct DreadHunger.DH_OnlineError
// 0x0020
struct FDH_OnlineError
{
	int                                                Code;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class FString                                      RawError;                                                 // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              AddDelayTime;                                             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct DreadHunger.DH_VivoxError
// 0x0030
struct FDH_VivoxError
{
	int                                                Code;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class FString                                      RawError;                                                 // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class FString                                      Origin;                                                   // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              AddDelayTime;                                             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct DreadHunger.DH_PokerGameTimeStat
// 0x000C
struct FDH_PokerGameTimeStat
{
	EPokerGameTimeStatType                             Type;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              TimeInterval;                                             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ServerTimeStarted;                                        // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct DreadHunger.DH_PriceDataWrapper
// 0x0060
struct FDH_PriceDataWrapper
{

};

// ScriptStruct DreadHunger.DH_OnlineSearchResult
// 0x0188
struct FDH_OnlineSearchResult
{
	TMap<struct FName, class FString>                  StringSettings;                                           // 0x0000(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bShowMapName;                                             // 0x0050(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
	struct FText                                       LocalizedMapName;                                         // 0x0058(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData01[0x118];                                     // 0x0070(0x0118) MISSED OFFSET
};

// ScriptStruct DreadHunger.DH_XPProgressData
// 0x000C
struct FDH_XPProgressData
{
	int                                                StartValue;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                EndValue;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BonusValue;                                               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct DreadHunger.PlayingCardHand
// 0x0038
struct FPlayingCardHand
{
	class ADH_LobbyPawn*                               Holder;                                                   // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FPlayingCardProperties>              Cards;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	EPokerHandRank                                     HandRank;                                                 // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	TArray<EPlayingCardRank>                           OrderedValues;                                            // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
};

// ScriptStruct DreadHunger.PlayingCardProperties
// 0x0008
struct FPlayingCardProperties
{
	EPlayingCardSuit                                   Suit;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EPlayingCardRank                                   Rank;                                                     // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	int                                                HandIndex;                                                // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct DreadHunger.CustomGameSetting
// 0x0088
struct FCustomGameSetting
{
	class FString                                      Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FCustomGameSettingValueRange                ValueRange;                                               // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	struct FCustomGameSettingUIData                    UISettings;                                               // 0x0020(0x0068) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct DreadHunger.CustomGameSettingUIData
// 0x0068
struct FCustomGameSettingUIData
{
	ESettingValueAdjustmentType                        ValueAdjustmentType;                                      // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	ESettingValueDisplayType                           ValueDisplayType;                                         // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	struct FText                                       LabelText;                                                // 0x0008(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FText                                       Description;                                              // 0x0020(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	class UTexture2D*                                  Icon;                                                     // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                BorderColor;                                              // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FMargin                                     BorderPadding;                                            // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SliderIncrement;                                          // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
};

// ScriptStruct DreadHunger.CustomGameSettingValueRange
// 0x000C
struct FCustomGameSettingValueRange
{
	float                                              Min;                                                      // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Max;                                                      // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Default;                                                  // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct DreadHunger.ActorRandomizationGroup
// 0x0070
struct FActorRandomizationGroup
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) UNKNOWN PROPERTY: 
	struct FLinearColor                                VisualizationColor;                                       // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	TMap<class AActor*, struct FActorTypeRandomization> ActorTypes;                                               // 0x0020(0x0050) (Edit, DisableEditOnTemplate)
};

// ScriptStruct DreadHunger.ActorTypeRandomization
// 0x0018
struct FActorTypeRandomization
{
	struct FDHFloatInterval                            SpawnChance;                                              // 0x0000(0x0008) (Edit, DisableEditOnTemplate)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct DreadHunger.DHFloatInterval
// size:0x0000 (0x0008 - 0x0008)
struct FDHFloatInterval : public FFloatInterval
{

};

// ScriptStruct DreadHunger.AnimalAttack
// 0x0048
struct FAnimalAttack
{
	float                                              Damage;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageDelay;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAttackType                                        AttackType;                                               // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              AttackRange;                                              // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDamageType*                                 DamageType;                                               // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AOERadius;                                                // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class UAnimSequenceBase*                           Animation;                                                // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAttackAnimationSlot                               AnimationSlot;                                            // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	class USoundBase*                                  Sound;                                                    // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBlocksMovement;                                          // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	float                                              Impulse;                                                  // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAttackImpulseDirection                            ImpulseDirection;                                         // 0x0040(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
};

// ScriptStruct DreadHunger.AttackFlash
// 0x0008
struct FAttackFlash
{
	unsigned char                                      Count;                                                    // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      Type;                                                     // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	float                                              Time;                                                     // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct DreadHunger.AIAttack
// 0x0018
struct FAIAttack
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDH_AIAttack*                                Type;                                                     // 0x0008(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	float                                              Weight;                                                   // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct DreadHunger.RandomMaterialsList
// 0x0010
struct FRandomMaterialsList
{
	TArray<class UMaterialInterface*>                  Materials;                                                // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct DreadHunger.MaterialSectionVisibilityMap
// 0x0010
struct FMaterialSectionVisibilityMap
{
	TArray<int>                                        HiddenSections;                                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct DreadHunger.SnareFlash
// 0x0010
struct FSnareFlash
{
	class ADH_BearTrapPickup*                          Snare;                                                    // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Duration;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct DreadHunger.ClimbingAnimations
// 0x0018
struct FClimbingAnimations
{
	class UAnimSequenceBase*                           StartAnim;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           StopAnim;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpaceBase*                             BlendSpace;                                               // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct DreadHunger.CharacterIKData
// 0x0024
struct FCharacterIKData
{
	struct FName                                       Bone;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     BoneLocation;                                             // 0x0008(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Alpha;                                                    // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     EffectorLocation;                                         // 0x0018(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct DreadHunger.PreviewCosmeticItems
// 0x0050
struct FPreviewCosmeticItems
{
	TMap<unsigned char, struct FPreviewItemsList>      ItemList;                                                 // 0x0000(0x0050)
};

// ScriptStruct DreadHunger.PreviewItemsList
// 0x0010
struct FPreviewItemsList
{
	TArray<class UDH_CosmeticItemBase*>                Items;                                                    // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct DreadHunger.PreviewAvatarCameraPerspective
// 0x0040
struct FPreviewAvatarCameraPerspective
{
	struct FTransform                                  CameraTransform;                                          // 0x0000(0x0030) (Edit, IsPlainOldData)
	float                                              FOV;                                                      // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              InterpSpeed;                                              // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxCameraPanAngle;                                        // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct DreadHunger.CosmeticsItemsList
// 0x0020
struct FCosmeticsItemsList
{
	TArray<class UDH_CosmeticBundle*>                  Bundles;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UDH_CosmeticItemBase*>                NonBundleItems;                                           // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct DreadHunger.CraftingRecord
// 0x0010
struct FCraftingRecord
{
	class UDH_CraftingRecipe*                          Recipe;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CraftCount;                                               // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct DreadHunger.PotentialCraftingProject
// 0x0060
struct FPotentialCraftingProject
{
	class UDH_CraftingRecipe*                          Recipe;                                                   // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
	struct FTransform                                  PreviewTransform;                                         // 0x0010(0x0030) (BlueprintVisible, IsPlainOldData)
	class UStaticMeshComponent*                        PreviewMesh;                                              // 0x0040(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FVector                                     PlacementBounds;                                          // 0x0048(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bHasValidPlacement;                                       // 0x0054(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xB];                                       // 0x0055(0x000B) MISSED OFFSET
};

// ScriptStruct DreadHunger.CraftingIngredientData
// 0x0020
struct FCraftingIngredientData
{
	struct FText                                       FriendlyName;                                             // 0x0000(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UTexture2D*                                  Icon;                                                     // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct DreadHunger.CraftingIngredientFamilyData
// size:0x0010 (0x0020 - 0x0030)
struct FCraftingIngredientFamilyData : public FCraftingIngredientData
{
	TArray<EInventoryType>                             MEMBERS;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct DreadHunger.ActivityProp
// 0x0040
struct FActivityProp
{
	class UStaticMesh*                                 StaticMesh;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       AttachSocket;                                             // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FTransform                                  AttachTransform;                                          // 0x0010(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct DreadHunger.PathActivity
// 0x0018
struct FPathActivity
{
	struct FName                                       ActivityName;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ActivityActor;                                            // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
